{
  "backend/main.mo": "Main actor for the ICP backend defining all core data types (ServiceRequest, ClientDocument, ComplianceDeliverable, PaymentRecord, analytics metrics, etc.) and including authorization and blob-storage mixins with data migration support.",
  "backend/migration.mo": "Data migration module that upgrades stored records (ToDoItems, TimelineEntries, FollowUpItems, DeadlineRecords) by adding a new `clientPrincipal` field, preserving existing client references where applicable.",
  "feature_evidence.json": "Feature evidence report mapping three client-facing compliance task features (hooks, UI tabs, and create forms) to their implementing files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "A JSON-formatted reference document summarizing the purpose and key details of each frontend source file, serving as a build-planning index for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design system's light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the FINPROLEDGE React SPA, mounting the app at `#root` and loading the TypeScript entry point via a module script.",
  "frontend/src/App.tsx": "Root React application component that configures TanStack Router with all page routes (home, service booking, client portal, compliance, compliance-admin, admin dashboard) and wraps the app in QueryClient, ThemeProvider, and Toaster providers.",
  "frontend/src/components/AdminClientDeliverableTable.tsx": "Displays a table of all client-submitted deliverables with status badges and accept/reject action buttons, fetching client names via principal lookup.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that restricts access to admin-only areas by checking authentication state and verifying the user's email matches the hardcoded admin email.",
  "frontend/src/components/AdminPaymentSettings.tsx": "Admin form for configuring the PayPal receiving email address, with validation, loading state, and success/error feedback.",
  "frontend/src/components/AdminPaymentTable.tsx": "Displays all client payment records in a table with status badges and a dropdown to update payment status, plus a banner showing the configured PayPal receiving account.",
  "frontend/src/components/analytics/ClientRetentionSection.tsx": "Analytics section that visualizes returning vs. new visitor ratios via a donut pie chart and displays a portal funnel drop-off table using static scaled data combined with backend ClientRetentionMetrics.",
  "frontend/src/components/analytics/ConversionAnalysisSection.tsx": "Analytics section that prominently displays the overall conversion rate and renders a goal breakdown table showing visits, completions, and per-goal conversion rates for key user actions.",
  "frontend/src/components/analytics/LeadGenerationSection.tsx": "Renders a Lead Generation Analysis section displaying form submission rate, click-to-call count, and a lead quality breakdown table (high/medium/low) using card and table UI components.",
  "frontend/src/components/analytics/SearchIntentSection.tsx": "Shows a Search Intent & SEO section with local SEO keyword tracking counts, AI search visibility score, seasonal traffic bar chart, and a local keyword rankings table.",
  "frontend/src/components/analytics/SEOAnalysisSection.tsx": "Displays an SEO Analysis section with stat cards for SEO score, click-through rate, and backlink health, plus a keyword rankings table with position deltas and domain authority info.",
  "frontend/src/components/analytics/TechnicalPerformanceSection.tsx": "Renders a Technical Performance section displaying Core Web Vitals (LCP, INP, CLS) with ratings, a mobile-friendliness score, and an error monitoring table listing 404s and broken links.",
  "frontend/src/components/analytics/TechnicalReliabilitySection.tsx": "Displays a Technical Reliability section with three cards covering SSL/security score, mobile responsiveness score, and page load speed, each with color-coded badges and progress bars.",
  "frontend/src/components/analytics/TrafficAcquisitionSection.tsx": "Renders a traffic and acquisition analytics section with a bar chart for source/medium breakdown, a pie chart for new vs. returning visitors, a landing pages table, and geographic distribution — falling back to static demo data when no real data is provided.",
  "frontend/src/components/analytics/TrustMetricsSection.tsx": "Displays trust and authority metrics including average time on About/Team pages, testimonial click counts, and a table of top blog articles with read counts, using data from the TrustMetrics backend type.",
  "frontend/src/components/analytics/UserBehaviorSection.tsx": "Shows user behavior and engagement metrics including average session duration, bounce rate, page views, sessions, scroll depth zones, and an event tracking table, falling back to static defaults when live data is zero.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Tabbed analytics dashboard that fetches site analytics data (falling back to mock data) and renders multiple specialized sections covering traffic, SEO, conversions, and more.",
  "frontend/src/components/ClientCreateDeadlineForm.tsx": "Form component for creating a new client compliance deadline with fields for title, description, due date, urgency level, and status.",
  "frontend/src/components/ClientCreateFollowUpForm.tsx": "A form component for creating client follow-up items with fields for title, description, due date, status, and notes, using the useCreateClientFollowUp mutation hook.",
  "frontend/src/components/ClientCreateTimelineForm.tsx": "A form component for creating client timeline entries with title, description, start/end dates, and status fields, using the useCreateClientTimeline mutation hook.",
  "frontend/src/components/ClientCreateToDoForm.tsx": "A form component for creating client to-do items with title, description, priority, and status fields, using the useCreateClientToDo mutation hook.",
  "frontend/src/components/ClientDeliverableForm.tsx": "A file upload form component that allows clients to submit deliverables (title, description, and file) with drag-and-drop support and upload progress tracking.",
  "frontend/src/components/ClientDeliverableTable.tsx": "A table component that displays a client's submitted deliverables with their title, description, submission date, and status badge (accepted, rejected, or pending review).",
  "frontend/src/components/ClientTasksTab.tsx": "A client-facing tab component that displays and manages the client's to-dos, timelines, follow-ups, and deadlines using tabbed cards with status/priority badges and dialogs for creating new items.",
  "frontend/src/components/ComplianceAdminDeadlineCountdown.tsx": "An admin component that shows sorted compliance deliverables and active deadline records in tables with countdown days remaining, urgency/status badges, and a dialog to create new deadlines.",
  "frontend/src/components/ComplianceAdminFollowUp.tsx": "An admin component that lists compliance deliverables stuck in drafting/review and admin follow-up items sorted by due date, with status badges and a dialog to add new follow-up items.",
  "frontend/src/components/ComplianceAdminTimeline.tsx": "An admin component that renders a monthly bar-chart-style timeline grouping compliance deliverables by due month across a 6-month window, alongside a table of admin timeline entries with status badges and a create dialog.",
  "frontend/src/components/ComplianceAdminToDoList.tsx": "An admin to-do list component that displays compliance deliverables and admin to-do records in filterable, sortable tables with status/priority/type badges, client name resolution, and a dialog to create new to-do items.",
  "frontend/src/components/ComplianceDocumentList.tsx": "Displays a card listing the current user's completed and approved compliance deliverables, with loading skeletons and a download button per document.",
  "frontend/src/components/CreateDeadlineForm.tsx": "Form component for creating a new compliance deadline record with fields for title, description, due date, urgency level, status, and optional deliverable reference.",
  "frontend/src/components/CreateFollowUpForm.tsx": "Form component for creating a follow-up item with fields for title, description, due date, optional client principal ID, status, and notes.",
  "frontend/src/components/CreateTimelineForm.tsx": "Form component for creating a timeline entry with title, description, start/end dates, status, and an optional task reference ID.",
  "frontend/src/components/CreateToDoForm.tsx": "Form component for creating a to-do task with title, description, priority, status, and an optional assigned client principal ID.",
  "frontend/src/components/DeliverableCard.tsx": "Renders a card UI for a compliance deliverable showing status, type, due date, urgency indicators, and approve/reject action buttons (currently stubbed as backend methods are not yet available).",
  "frontend/src/components/DocumentTable.tsx": "Displays a table of client documents with name, type badge, upload date, and a download button that opens the file's direct URL in a new tab.",
  "frontend/src/components/DocumentUploadForm.tsx": "Provides a drag-and-drop file upload form with document type selection, upload progress tracking, and success/error feedback using the useUploadDocument hook.",
  "frontend/src/components/EcwidWidget.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Layout.tsx": "Wraps page content with a sticky Navigation header and a footer containing company info, services list, contact details, and a caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, clearing the React Query cache on logout and handling already-authenticated edge cases.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with responsive mobile menu, dynamic links based on authentication state, and admin-only links (Admin Dashboard, Compliance Admin) shown only for the finproledge@gmail.com account.",
  "frontend/src/components/PaymentForm.tsx": "A payment submission form supporting multiple currencies, payment methods (credit/debit card, PayPal, Apple Pay, Google Pay), and card types, converting the amount to cents before calling the createPayment mutation.",
  "frontend/src/components/PaymentHistoryTable.tsx": "Displays a paginated table of the current user's payment history, including reference number, amount, payment method, status badge, and date, with loading skeletons and an empty state.",
  "frontend/src/components/ProtectedRoute.tsx": "Wraps child routes to require Internet Identity authentication, showing a spinner while initializing and a login prompt with navigation options if unauthenticated.",
  "frontend/src/components/ServiceRequestForm.tsx": "Form component that lets authenticated users submit a service request by selecting a service type, entering a description, phone number, and deadline, then calling the createRequest mutation.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that appears for authenticated users who have no saved profile, prompting them to enter their name, email, and company to complete initial setup.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, initializes access control with an admin token when authenticated, and invalidates all dependent queries when the actor changes.",
  "frontend/src/hooks/useAnalytics.ts": "Provides two React Query hooks — useGetAnalyticsSummary and useGetNewAnalyticsSummary — that fetch analytics data from the backend actor, returning null gracefully on failure or when the actor is unavailable.",
  "frontend/src/hooks/useApprovals.ts": "Exports React Query hooks for listing approvals, setting a user's approval status, checking if the caller is approved, and requesting approval, all backed by the ICP actor.",
  "frontend/src/hooks/useClientDeliverables.ts": "Provides hooks to fetch the current user's submitted deliverables, fetch all deliverables (admin), submit a new deliverable, and update a deliverable's status, with cache invalidation on mutations.",
  "frontend/src/hooks/useComplianceAdmin.ts": "Exports admin-facing React Query hooks for CRUD operations on compliance entities — to-dos, timelines, follow-ups, and deadlines — each with query invalidation on successful mutations.",
  "frontend/src/hooks/useDeliverables.ts": "Provides React Query hooks for fetching and creating compliance deliverables, including queries for the caller's own deliverables, pending deliverables, and all deliverables, plus a mutation to create new ones.",
  "frontend/src/hooks/useDocuments.ts": "Provides React Query hooks for fetching all client documents and uploading new documents via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/usePayments.ts": "Provides React Query hooks for payment operations including fetching the caller's payments, all payments, creating payments, updating payment status, and managing admin payment settings.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file that redirects consumers to use feature-specific query hooks instead.",
  "frontend/src/hooks/useServiceRequests.ts": "Provides React Query hooks for service request operations including fetching the caller's and all requests, creating authenticated and visitor requests, and updating request status.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching the caller's user profile, looking up a profile by principal, and saving/updating the caller's profile.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind directives, and defines CSS custom properties for a deep-navy/gold design system with light and dark mode themes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabbed sections for managing service requests, documents, approvals, payments, deliverables, and analytics, including status badge components and helper formatting functions.",
  "frontend/src/pages/ClientPortalPage.tsx": "Client portal page with tabbed navigation for managing service requests, documents (upload/view), payments, and deliverables, filtered to the authenticated user's principal.",
  "frontend/src/pages/ComplianceAdminDashboardPage.tsx": "Admin-only dashboard page with four tabs: To-Do List, Timeline, Follow-Up, and Deadline Countdown, wrapping corresponding compliance admin components inside an AdminGuard.",
  "frontend/src/pages/ComplianceDashboardPage.tsx": "Client-facing compliance dashboard showing summary stats, urgent deadline alerts, and tabbed views for deliverables, documents, and tasks.",
  "frontend/src/pages/HomePage.tsx": "Marketing home page featuring a hero section, service offerings, stats banner, and core principles for the FINPROLEDGE accounting firm.",
  "frontend/src/pages/ServiceBookingPage.tsx": "Service booking page that renders the ServiceRequestForm alongside a sidebar explaining the review, consultation, and execution workflow.",
  "frontend/src/pages/VisitorServiceRequestPage.tsx": "Public-facing service request form for unauthenticated visitors to submit their name, contact details, service type, and deadline without requiring login.",
  "frontend/src/utils/dateHelpers.ts": "Utility functions for converting nanosecond timestamps to days remaining, formatted date strings, and a due-soon check (within 5 days).",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom CSS-variable-based colors, typography (Lora/IBM Plex Sans fonts), border radii, box shadows, and enabling the animate and typography plugins.",
  "project_state.json": "Project state manifest describing a client/admin task management app, tracking existing features, new feature requests, architectural notes, and known issues across versioned schema."
}