{
  "backend/main.mo": "Main actor for the ICP backend defining all data types (ServiceRequest, ClientDocument, ComplianceDeliverable, PaymentRecord, analytics metrics, etc.) and including authorization and blob-storage mixins; uses a migration hook to discard deprecated deadline state.",
  "backend/migration.mo": "Migration module that defines legacy data type shapes and provides a `run` function to transform stable state during upgrades, preserving existing data while discarding deprecated deadline-related state components.",
  "feature_evidence.json": "Feature evidence report listing implemented features with associated file paths, component dependencies, test IDs, and confidence levels, covering deadline removal, admin status management, document handling, and other compliance dashboard changes.",
  "frontend-file-summaries.txt": "JSON-formatted catalog of frontend source file summaries describing the purpose and recent changes of each component, page, hook, and utility in the React frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, borders, chart palette, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the FINPROLEDGE single-page app that mounts the React root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React application component that configures TanStack Router with all page routes (home, service booking, client portal, compliance dashboard, compliance admin, admin dashboard) and wraps the app in QueryClient, ThemeProvider, and Toaster providers.",
  "frontend/src/components/AdminClientDeliverableTable.tsx": "Admin table component for viewing and managing all client deliverables, with support for adding new deliverables via a dialog form that includes file upload with progress tracking and status badge display.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that restricts access to admin-only areas by checking authentication state and verifying the logged-in user's email matches the hardcoded admin email.",
  "frontend/src/components/AdminPaymentSettings.tsx": "Admin settings form for configuring the PayPal receiving email address, with validation, success/error feedback, and a note that the setting is only visible to administrators.",
  "frontend/src/components/AdminPaymentTable.tsx": "Admin table displaying all client payment records with status badges, payment method labels, and inline status update controls, plus a banner showing the configured PayPal receiving account.",
  "frontend/src/components/analytics/ClientRetentionSection.tsx": "Displays client retention and portal usage analytics, including a pie chart of returning vs. new visitors and a funnel table showing drop-off rates at each portal step. Accepts ClientRetentionMetrics as props and derives percentages and scaled funnel data from them.",
  "frontend/src/components/analytics/ConversionAnalysisSection.tsx": "Renders a conversion and goal analysis section showing an overall conversion rate as a prominent card and a breakdown table of individual goals (form submissions, sign-ups, uploads) with visit and completion counts. Uses static goal data supplemented by a ConversionRate prop.",
  "frontend/src/components/analytics/LeadGenerationSection.tsx": "Displays lead generation metrics including form submission rate, click-to-call count, and a breakdown of lead quality (high/medium/low) by category. Derives display values from a LeadGenerationMetrics prop with fallback defaults.",
  "frontend/src/components/analytics/SearchIntentSection.tsx": "Renders a search intent and SEO section covering local SEO keyword tracking, AI search visibility score, seasonal traffic bar chart, and a local keyword rankings table. Accepts SearchIntentMetrics as props and uses static seasonal and keyword data for visualization.",
  "frontend/src/components/analytics/SEOAnalysisSection.tsx": "Shows SEO analysis metrics including an SEO score progress bar, click-through rate, backlink health, keyword rankings table, and domain authority. Accepts an SEOScore prop with bigint fields and falls back to static defaults when values are zero.",
  "frontend/src/components/analytics/TechnicalPerformanceSection.tsx": "Renders a Technical Performance section displaying Core Web Vitals (LCP, INP, CLS) as score cards with color-coded ratings, plus a static error monitoring table listing 404s and broken links.",
  "frontend/src/components/analytics/TechnicalReliabilitySection.tsx": "Displays a Technical Reliability section with three metric cards covering SSL/security score, mobile responsiveness score, and page load speed, each with color-coded badges and progress bars.",
  "frontend/src/components/analytics/TrafficAcquisitionSection.tsx": "Shows a Traffic & Acquisition Analysis section with a bar chart of visits/conversions by source, a pie chart of new vs. returning visitors, and a table of top landing pages.",
  "frontend/src/components/analytics/TrustMetricsSection.tsx": "Renders Trust & Authority Metrics including average time on About/Team pages, testimonial click counts, blog engagement stats, and a table of top blog articles by reads.",
  "frontend/src/components/analytics/UserBehaviorSection.tsx": "Displays User Behavior & Engagement metrics including average session duration, bounce rate, page views, and sessions, along with scroll depth zones and an event tracking table.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Tabbed analytics dashboard that fetches site analytics data (with mock fallbacks) and renders multiple sections covering traffic, SEO, conversions, lead generation, and other metrics.",
  "frontend/src/components/ClientCreateDeadlineForm.tsx": "Empty file with no content.",
  "frontend/src/components/ClientCreateFollowUpForm.tsx": "Form component that allows clients to create follow-up compliance items with title, description, due date, status, and notes fields, submitting via the useCreateClientFollowUp hook.",
  "frontend/src/components/ClientCreateTimelineForm.tsx": "A form component for creating a client timeline entry with title, description, start/end dates, and status fields, using the useCreateClientTimeline mutation hook.",
  "frontend/src/components/ClientCreateToDoForm.tsx": "A form component for creating a client to-do item with title, description, priority, and status fields, using the useCreateClientToDo mutation hook.",
  "frontend/src/components/ClientDeliverableForm.tsx": "A file upload form that allows clients to submit deliverables (title, description, and file) with drag-and-drop support and upload progress tracking.",
  "frontend/src/components/ClientDeliverableTable.tsx": "A table displaying a client's submitted deliverables with status badges and approve/reject action buttons for admin use.",
  "frontend/src/components/ClientTasksTab.tsx": "A tabbed interface showing a client's to-dos, timelines, and follow-ups, each with a table view and a dialog form for creating new entries.",
  "frontend/src/components/ComplianceAdminDeadlineCountdown.tsx": "An empty file with no content or exports.",
  "frontend/src/components/ComplianceAdminFollowUp.tsx": "A compliance admin component that displays all follow-up items in a table with status selectors and provides a dialog form for creating new follow-ups.",
  "frontend/src/components/ComplianceAdminTimeline.tsx": "Displays a table of compliance timeline entries with status badges and date formatting, and provides a dialog form to create new timeline entries.",
  "frontend/src/components/ComplianceAdminToDoList.tsx": "Renders a table of compliance to-do items with priority and status badges, and includes a dialog form for creating new to-do items.",
  "frontend/src/components/ComplianceDocumentList.tsx": "Shows a card listing completed and approved compliance deliverables with type labels, dates, and status badges fetched via the useGetMyDeliverables hook.",
  "frontend/src/components/CreateDeadlineForm.tsx": "Empty file with no content.",
  "frontend/src/components/CreateFollowUpForm.tsx": "Form component for creating a new follow-up item with fields for title, description, due date, client principal, status, and notes, using the useCreateFollowUp mutation hook.",
  "frontend/src/components/CreateTimelineForm.tsx": "Form component for creating a new compliance timeline entry with title, description, start/end dates, status, and optional task reference, using the useCreateTimeline mutation hook.",
  "frontend/src/components/CreateToDoForm.tsx": "A form component for creating new To-Do items with fields for title, description, priority, status, and optional client principal assignment, using React Query mutation and validation.",
  "frontend/src/components/DeliverableCard.tsx": "Displays a single compliance deliverable as a card with status/type badges, due date urgency indicators, and placeholder approve/reject action buttons (backend not yet implemented).",
  "frontend/src/components/DocumentTable.tsx": "Renders a table of client documents with type badges, upload dates, and a download button that triggers a direct URL download for each document.",
  "frontend/src/components/DocumentUploadForm.tsx": "A drag-and-drop file upload form that converts a selected file to an ExternalBlob and submits it with a document type selection, showing upload progress and success/error feedback.",
  "frontend/src/components/EcwidWidget.tsx": "An empty file with no content.",
  "frontend/src/components/Layout.tsx": "Wraps the app with a top Navigation, main content area, and a footer containing company info, services list, contact details, and a caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading state during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/MyComplianceTasksSection.tsx": "Displays a tabbed section showing the current user's To-Dos, Timelines, and Follow-Ups with summary stats, inline status selects, and dialogs for creating new items of each type.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar with links that conditionally show based on authentication state, including admin-only links for users with the admin email, plus a mobile hamburger menu.",
  "frontend/src/components/PaymentForm.tsx": "Form component for submitting a payment request with fields for amount, currency, payment method, and card type, using the useCreatePayment hook and displaying success/error feedback.",
  "frontend/src/components/PaymentHistoryTable.tsx": "Displays a paginated table of the current user's payment history with formatted amounts, status badges, and payment method labels, with loading skeletons and an empty state.",
  "frontend/src/components/ProtectedRoute.tsx": "Wraps child routes to require Internet Identity authentication, showing a loading spinner during initialization and a login prompt with navigation options when unauthenticated.",
  "frontend/src/components/ServiceRequestForm.tsx": "Form for submitting a new service request by selecting a service type and entering a description, using the useCreateRequest hook with toast notifications for success and error states.",
  "frontend/src/components/TaskStatusSelect.tsx": "Provides three optimistic-update select components (ToDoStatusSelect, TimelineStatusSelect, FollowUpStatusSelect) for updating compliance task statuses inline with loading indicators and toast feedback.",
  "frontend/src/components/UserProfileSetup.tsx": "A modal dialog component that prompts newly authenticated users to complete their profile (name, email, company) using Internet Identity. It conditionally renders when the user is authenticated but has no saved profile, and submits the data via a save profile mutation.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an authenticated or anonymous backend actor using React Query, reinitializing it when the Internet Identity changes and invalidating dependent queries accordingly.",
  "frontend/src/hooks/useAnalytics.ts": "Provides two React Query hooks for fetching analytics data from the backend actor: `useGetAnalyticsSummary` for legacy traffic/SEO/performance metrics and `useGetNewAnalyticsSummary` for lead generation, trust, and retention metrics.",
  "frontend/src/hooks/useApprovals.ts": "Provides React Query hooks for managing user approvals, including listing approvals, setting approval status, checking if the caller is approved, and requesting approval.",
  "frontend/src/hooks/useClientDeliverables.ts": "Provides React Query hooks for client deliverable operations: fetching own or all submitted deliverables, submitting deliverables (with optional upload progress), submitting on behalf of a client, and updating deliverable status.",
  "frontend/src/hooks/useComplianceAdmin.ts": "Provides React Query hooks for compliance management, covering CRUD operations for to-dos, timelines, and follow-ups, with both admin (all records) and user-scoped (my records) query variants.",
  "frontend/src/hooks/useDeliverables.ts": "Provides React Query hooks for compliance deliverables: fetching the current user's deliverables (all and pending), fetching all deliverables as admin, and creating new deliverables assigned to a client.",
  "frontend/src/hooks/useDocuments.ts": "Provides React Query hooks for document management: fetching all client documents and uploading a new document with a specified type and file blob.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using `@dfinity/auth-client`, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/usePayments.ts": "Provides React Query hooks for payment operations: fetching own or all payments, creating payments, updating payment status, and getting/setting admin payment settings.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file that previously aggregated queries; functionality has been moved to feature-specific hooks.",
  "frontend/src/hooks/useServiceRequests.ts": "Provides React Query hooks for service request operations: fetching own or all requests, creating authenticated or visitor requests, and updating request status.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching the caller's user profile, fetching a profile by principal, and saving/updating the caller's user profile via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind directives, and defines CSS custom properties for light/dark theme color tokens including navigation, accent, and semantic colors.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider, InternetIdentityProvider, and the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin-only dashboard page with tabbed views for managing service requests, documents, approvals, payments, client deliverables, and analytics, using various admin hooks and guard components.",
  "frontend/src/pages/ClientPortalPage.tsx": "Authenticated client portal page with tabs for submitting service requests, viewing/uploading documents, making payments, and managing deliverables.",
  "frontend/src/pages/ComplianceAdminDashboardPage.tsx": "Admin-guarded compliance dashboard page with tabs for managing a to-do list, timeline, and follow-up tasks via dedicated compliance admin components.",
  "frontend/src/pages/ComplianceDashboardPage.tsx": "Client-facing compliance dashboard page with tabs for viewing compliance tasks, submitting/viewing deliverables, task deadlines, and compliance documents.",
  "frontend/src/pages/HomePage.tsx": "Public marketing home page displaying a hero section, service offerings, company stats, and core principles for the FinProLedge financial services firm.",
  "frontend/src/pages/ServiceBookingPage.tsx": "Renders a service booking page with a two-column layout containing a ServiceRequestForm and a sidebar explaining the review/consultation/execution process and the company's delivery guarantee.",
  "frontend/src/pages/VisitorServiceRequestPage.tsx": "Public-facing contact/service request form page for unauthenticated visitors that collects name, email, company, phone, service type, and description, then submits via the createVisitorRequest mutation and shows a success screen on completion.",
  "frontend/src/utils/dateHelpers.ts": "Provides utility functions for working with nanosecond-precision Time values: calculating days remaining until a deadline, formatting a timestamp as a readable date string, and checking whether a deadline falls within the next 5 days.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive parameters from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the default theme with CSS-variable-based color tokens, Lora/IBM Plex Sans font families, custom border radii, box shadows, and enables the animate and typography plugins.",
  "project_state.json": "Tracks the current project state at schema version 1.0.0, listing existing implemented features (deadline removal, admin status changes, document download format preservation, compliance deliverables, etc.) along with architectural notes and known issues for a client/admin portal."
}