{
  "backend/main.mo": "Main Motoko actor for the FINPROLEDGE backend, defining all core data types (ServiceRequest, ClientDocument, ComplianceDeliverable, PaymentRecord, etc.) and mixing in authorization and blob storage functionality.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering pages, components, and hooks for the FINPROLEDGE app.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, mounting the React root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with all page routes (including protected admin/compliance-admin routes), QueryClient, ThemeProvider, and Toaster.",
  "frontend/src/components/AdminClientDeliverableTable.tsx": "Admin table component for viewing, filtering, sorting, and managing client-submitted deliverables, with status updates (accept/reject), download options, and an admin form to submit deliverables on behalf of clients.",
  "frontend/src/components/AdminGuard.tsx": "Authorization guard component that restricts access to admin pages by verifying the user is authenticated, passes a backend `isAdminUser()` check, and has the specific admin email (finproledge@gmail.com).",
  "frontend/src/components/AdminPaymentSettings.tsx": "Admin-only form component for configuring the PayPal receiving email address, with validation, success/error alerts, and persistence via a mutation hook.",
  "frontend/src/components/AdminPaymentTable.tsx": "Displays a table of all client payment records with status badges, payment method labels, and an inline status update selector, plus a banner showing the configured PayPal account.",
  "frontend/src/components/analytics/ClientRetentionSection.tsx": "Displays client retention analytics including a donut pie chart of returning vs. new visitors and a portal funnel drop-off table, derived from `ClientRetentionMetrics` data passed as props.",
  "frontend/src/components/analytics/ConversionAnalysisSection.tsx": "Renders a conversion and goal analysis section with a prominent overall conversion rate card and a breakdown table of individual goals (form submissions, sign-ups, uploads), using data from a `ConversionRate` prop.",
  "frontend/src/components/analytics/LeadGenerationSection.tsx": "Renders a Lead Generation Analysis section displaying form submission rate, click-to-call count, and a lead quality breakdown table (high/medium/low) using card and table UI components.",
  "frontend/src/components/analytics/SearchIntentSection.tsx": "Shows a Search Intent & SEO section with local SEO keyword tracking counts, AI search visibility score, seasonal traffic bar chart, and a local keyword rankings table.",
  "frontend/src/components/analytics/SEOAnalysisSection.tsx": "Displays an SEO Analysis section with stat cards for SEO score, click-through rate, and backlink health, plus a keyword rankings table with position deltas and domain authority info.",
  "frontend/src/components/analytics/TechnicalPerformanceSection.tsx": "Renders a Technical Performance section displaying Core Web Vitals (LCP, INP, CLS) with ratings, a mobile-friendliness score, and an error monitoring table listing 404s and broken links.",
  "frontend/src/components/analytics/TechnicalReliabilitySection.tsx": "Displays a Technical Reliability section with three cards covering SSL/security score, mobile responsiveness score, and page load speed, each with color-coded badges and progress bars.",
  "frontend/src/components/analytics/TrafficAcquisitionSection.tsx": "Renders a traffic and acquisition analytics section with a bar chart for source/medium breakdown and a pie chart for new vs. returning visitors, plus a landing pages table. Falls back to hardcoded sample data when no real sources are provided.",
  "frontend/src/components/analytics/TrustMetricsSection.tsx": "Displays trust and authority metrics including average time on About/Team pages, testimonial click counts, and a blog article engagement table with static sample articles. Accepts a TrustMetrics data prop from the backend.",
  "frontend/src/components/analytics/UserBehaviorSection.tsx": "Shows user behavior and engagement stats (average session duration, bounce rate, page views, sessions) alongside scroll depth zones and an event tracking table. Falls back to hardcoded defaults when session metrics are zero.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Tabbed analytics dashboard that fetches site analytics data (falling back to mock data) and renders multiple sections covering traffic, SEO, conversions, lead generation, and more.",
  "frontend/src/components/ClientCreateDeadlineForm.tsx": "Empty file with no content.",
  "frontend/src/components/ClientCreateFollowUpForm.tsx": "Form component that allows clients to create follow-up items with a title, description, due date, status, and notes, submitting via a mutation hook with toast notifications.",
  "frontend/src/components/ClientCreateTimelineForm.tsx": "Form component for creating client timeline entries with title, description, start/end dates, and status, including date validation and submission via a mutation hook.",
  "frontend/src/components/ClientCreateToDoForm.tsx": "A form component for clients to create new To-Do items with title, description, priority, status, and optional file attachment fields, using the useCreateClientToDo mutation hook.",
  "frontend/src/components/ClientDeliverableForm.tsx": "A form component that allows clients to submit deliverables by uploading a file with a title and description, showing upload progress and success/error feedback via toasts.",
  "frontend/src/components/ClientDeliverableTable.tsx": "A table component that displays a client's submitted deliverables with their status badges and allows admins to approve or reject each deliverable.",
  "frontend/src/components/ClientTasksTab.tsx": "A tabbed interface component displaying a client's To-Dos, Timelines, and Follow-Ups in separate tables, each with a dialog for creating new entries and inline status selectors.",
  "frontend/src/components/ComplianceAdminDeadlineCountdown.tsx": "An empty file with no content or implementation.",
  "frontend/src/components/ComplianceAdminFollowUp.tsx": "An admin table component that lists all client follow-up items with sortable columns, per-column text/status filters, and inline status update controls, resolving client principals to profile names.",
  "frontend/src/components/ComplianceAdminTimeline.tsx": "Admin table component displaying all client timeline entries with sortable columns, per-column filters, and a status badge. Fetches data via `useGetAllTimelines` and resolves client names using `useGetUserProfileByPrincipal`.",
  "frontend/src/components/ComplianceAdminToDoList.tsx": "Admin table component listing all client to-do items with sortable columns, filters, priority/status badges, and a download menu. Uses `useGetAllToDos` for data and `useGetUserProfileByPrincipal` for client name resolution.",
  "frontend/src/components/ComplianceDocumentList.tsx": "Client-facing card component that lists completed and approved compliance deliverables fetched via `useGetMyDeliverables`, showing type labels, dates, and status badges.",
  "frontend/src/components/CreateDeadlineForm.tsx": "Empty file with no content.",
  "frontend/src/components/CreateFollowUpForm.tsx": "Form component for admins to create a follow-up item, collecting title, description, due date, status, notes, and an optional client reference from approved users, then submitting via `useCreateFollowUp`.",
  "frontend/src/components/CreateTimelineForm.tsx": "Form component for admins to create a timeline entry with title, description, start/end dates, status, and an optional client principal, submitting via `useCreateTimelineEntry`.",
  "frontend/src/components/CreateToDoForm.tsx": "A React form component for creating compliance to-do items with fields for title, description, priority, status, assigned client, and optional document upload, using mutation hooks and toast notifications.",
  "frontend/src/components/DeliverableCard.tsx": "A card component that displays a compliance deliverable's details including status, type, due date, and urgency indicators, with placeholder approve/reject mutation buttons that currently throw errors.",
  "frontend/src/components/DocumentTable.tsx": "A table component that renders a list of client documents with type badges, upload dates, and per-row download buttons, plus an optional admin bulk-export menu via DownloadOptionsMenu.",
  "frontend/src/components/DocumentUploadForm.tsx": "A drag-and-drop file upload form that lets users select a document type and upload a file as an ExternalBlob to the backend using the useUploadDocument mutation hook.",
  "frontend/src/components/DownloadOptionsMenu.tsx": "A dropdown menu component that offers multiple export formats (PDF, XLSX, DOCX, CSV, ZIP, image) for table data or file blobs, delegating to utility export functions with loading state tracking.",
  "frontend/src/components/EcwidWidget.tsx": "An empty or minimal component file, likely a placeholder for an Ecwid e-commerce widget integration.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with a sticky Navigation header, a flexible main content area, and a multi-column footer containing brand info, service links, quick links, and contact details.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, toggling between login and logout actions with loading state feedback.",
  "frontend/src/components/MyComplianceTasksSection.tsx": "Displays a tabbed dashboard for the current user's compliance tasks (To-Dos, Timelines, Follow-Ups) with summary stats, data tables, and dialogs for creating new items.",
  "frontend/src/components/Navigation.tsx": "Renders the sticky top navigation bar with a logo, desktop/mobile menus, a services dropdown, admin link (conditionally shown), and a login button.",
  "frontend/src/components/PaymentForm.tsx": "Provides a form for submitting payment requests with fields for amount, currency, payment method, and card type, storing amounts as integer cents and showing success/error feedback.",
  "frontend/src/components/PaymentHistoryTable.tsx": "Fetches and displays the current user's payment history in a styled table with columns for reference number, amount, payment method, status badge, and date.",
  "frontend/src/components/ProtectedRoute.tsx": "Guards child routes by checking Internet Identity authentication status, showing a loading spinner during initialization or a login prompt if unauthenticated.",
  "frontend/src/components/ServiceRequestForm.tsx": "A form component that allows authenticated users to submit service requests by selecting a service type, entering a description, and choosing a deadline. On submission it calls the `useCreateRequest` mutation and shows toast notifications for success or failure.",
  "frontend/src/components/TaskStatusSelect.tsx": "Exports three optimistic-update select components (ToDoStatusSelect, TimelineStatusSelect, FollowUpStatusSelect) that let admins change the status of to-dos, timeline items, and follow-ups inline, with loading indicators and toast feedback.",
  "frontend/src/components/UserProfileSetup.tsx": "A modal dialog that appears after a user authenticates via Internet Identity but has no profile, prompting them to enter their name, email, and company to create a profile via the `useSaveCallerUserProfile` mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an Internet Computer actor using the current Internet Identity, initializing admin access control if a token is present. Invalidates and refetches all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAnalytics.ts": "Provides two React Query hooks—useGetAnalyticsSummary and useGetNewAnalyticsSummary—that fetch analytics data from the backend actor, returning null gracefully if the actor is unavailable or the method doesn't exist.",
  "frontend/src/hooks/useApprovals.ts": "Exports React Query hooks for listing approvals, setting a user's approval status, checking if the caller is approved, and requesting approval, all backed by the backend actor with cache invalidation on mutations.",
  "frontend/src/hooks/useClientDeliverables.ts": "Provides React Query hooks for fetching, submitting, and updating client deliverables, including support for upload progress callbacks and submitting deliverables on behalf of a specific client principal.",
  "frontend/src/hooks/useComplianceAdmin.ts": "Provides React Query hooks for CRUD operations on to-dos, timelines, and follow-ups, supporting both admin (all records) and client (my records) views via the backend actor.",
  "frontend/src/hooks/useDeliverables.ts": "Provides React Query hooks to fetch personal, pending, and all compliance deliverables, and to create new deliverables via the backend actor.",
  "frontend/src/hooks/useDocuments.ts": "Provides React Query hooks to fetch all client documents and upload new documents via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity state, and login status to child components.",
  "frontend/src/hooks/usePayments.ts": "Provides React Query hooks for creating payments, fetching personal and all payment records, updating payment status, and managing admin payment settings via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file that re-exports nothing, deferring query logic to feature-specific hook files.",
  "frontend/src/hooks/useServiceRequests.ts": "Provides React Query hooks to create, fetch, and update service requests for both authenticated users and visitors via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks to fetch and save the caller's user profile and look up any user profile by principal via the backend actor.",
  "frontend/src/index.css": "Defines global CSS custom properties for a dark-themed design system (navy/gold palette) and sets base typography using Lora and IBM Plex Sans fonts via Tailwind layers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutUsPage.tsx": "Renders the About Us marketing page with a hero section, mission statement, and a grid of four core competency cards (Taxation, Assurance, Accounting, Financial Administration). Includes a call-to-action linking to the service booking page.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin-only dashboard page wrapped in AdminGuard that provides tabbed access to service requests, documents, deliverables, payments, analytics, approvals, and compliance management tools. Uses multiple admin-specific hooks and components to display and mutate backend data.",
  "frontend/src/pages/ClientPortalPage.tsx": "Authenticated client portal with four tabs—My Requests, Documents, Payments, and My Deliverables—filtering data to the logged-in user's principal. Composes service request, document upload, payment, and deliverable components into a single tabbed interface.",
  "frontend/src/pages/ComplianceAdminDashboardPage.tsx": "Admin-guarded compliance management page with three tabs (To-Do List, Timeline, Follow-Up), each with a dialog-triggered creation form and a corresponding list/table component. Manages dialog open state locally for each tab.",
  "frontend/src/pages/ComplianceDashboardPage.tsx": "Client-facing compliance dashboard requiring Internet Identity authentication, offering four tabs: My Compliance Tasks, My Deliverables, Tasks (deadlines), and Documents. Composes existing compliance section components into a unified tabbed view.",
  "frontend/src/pages/HomePage.tsx": "Public-facing home page showcasing the firm's services (income tax, GST, audits, payroll, etc.) with detailed service cards, a hero section, and calls-to-action linking to service booking. Defines a static services array with icons, descriptions, and detail text.",
  "frontend/src/pages/ServiceBookingPage.tsx": "A page for booking services that renders a two-column layout with a ServiceRequestForm on the left and a sidebar on the right showing next steps and a quality guarantee.",
  "frontend/src/pages/VisitorServiceRequestPage.tsx": "A public-facing contact/service request page with a form for visitors to submit service inquiries, showing a success screen after submission via the useCreateVisitorRequest hook.",
  "frontend/src/utils/dateHelpers.ts": "Utility functions for working with nanosecond-precision Time values, including calculating days remaining, formatting deadlines, and checking if a deadline is within 5 days.",
  "frontend/src/utils/fileExport.ts": "Client-side export utilities that convert table row data to downloadable CSV, XLSX (SpreadsheetML), and Word-compatible HTML document files using only browser-native APIs.",
  "frontend/src/utils/tableHelpers.ts": "Generic table utilities providing type-aware sorting, multi-field filtering, and sort-direction toggling for use with tabular data components.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive parameters from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with CSS-variable-based color tokens (including navy/gold palette), custom fonts (Lora, IBM Plex Sans), border radii, box shadows, and typography plugin settings.",
  "project_state.json": "Tracks the FinProLedge project state including three pending fix/feature requests: fixing approvals list truncation (AR-1/AR-4), fixing file corruption in the Deliverables/To-Dos upload workflow (AR-2/AR-5), and adding a filter bar to the Documents view (AR-3/AR-6)."
}