{
  "backend/main.mo": "Main Motoko actor defining all backend types (ServiceRequest, ClientDocument, ComplianceDeliverable, PaymentRecord, etc.) and mixing in authorization and blob storage functionality for the FINPROLEDGE financial services platform.",
  "feature_evidence.json": "Feature evidence report documenting two navigation restructuring features: moving 'Compliance' under the Client Portal dropdown and 'Compliance Admin' under the Admin dropdown in Navigation.tsx.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short summaries describing the purpose and key changes of each component, hook, and page in the frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell titled 'FINPROLEDGE' that mounts the React app via a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with all page routes (including protected routes for client portal, admin, compliance, and compliance-admin), QueryClient, and ThemeProvider.",
  "frontend/src/components/AdminClientDeliverableTable.tsx": "Admin table component for viewing and managing client deliverables, with status badges, a dialog form for submitting deliverables on behalf of clients, and upload progress tracking.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that restricts access to admin areas by checking authentication state and verifying the user's email matches the hardcoded admin email (finproledge@gmail.com).",
  "frontend/src/components/AdminPaymentSettings.tsx": "Admin-only form component for configuring the PayPal receiving email address, with validation, success/error alerts, and persistence via a mutation hook.",
  "frontend/src/components/AdminPaymentTable.tsx": "Displays a table of all client payment records with status badges, payment method labels, and an inline status-update selector, plus a banner showing the configured PayPal account.",
  "frontend/src/components/analytics/ClientRetentionSection.tsx": "Displays a client retention analytics section with a pie chart comparing returning vs. new visitors and a funnel table showing portal drop-off rates at each step.",
  "frontend/src/components/analytics/ConversionAnalysisSection.tsx": "Shows an overall conversion rate metric card and a goal breakdown table (form submissions, sign-ups, uploads) derived from backend ConversionRate data with static fallback values.",
  "frontend/src/components/analytics/LeadGenerationSection.tsx": "Renders lead generation analytics including form submission rate, click-to-call count, and a quality breakdown table (high/medium/low) sourced from LeadGenerationMetrics backend data.",
  "frontend/src/components/analytics/SearchIntentSection.tsx": "React component that displays search intent and SEO metrics including local SEO keyword rankings, seasonal traffic trends via a bar chart, and AI search visibility score using data from SearchIntentMetrics.",
  "frontend/src/components/analytics/SEOAnalysisSection.tsx": "Displays SEO analytics including an SEO score progress bar, click-through rate, backlink health, and a keyword ranking table with position deltas, using backend SEOScore data with static fallbacks.",
  "frontend/src/components/analytics/TechnicalPerformanceSection.tsx": "React component that renders Core Web Vitals (LCP, INP, CLS) scores with ratings, a mobile-friendliness score, and a static error monitoring table showing 404s and broken links.",
  "frontend/src/components/analytics/TechnicalReliabilitySection.tsx": "React component that displays technical reliability metrics including SSL/security status, mobile responsiveness score, and page load speed using data from TechnicalReliabilityMetrics.",
  "frontend/src/components/analytics/TrafficAcquisitionSection.tsx": "React component that visualizes traffic acquisition data with a bar chart for source/medium breakdown, a pie chart for new vs. returning visitors, and a table of top landing pages.",
  "frontend/src/components/analytics/TrustMetricsSection.tsx": "React component that shows trust and authority metrics including average time on About/Team pages, testimonial click counts, and a table of top blog articles by read count using TrustMetrics data.",
  "frontend/src/components/analytics/UserBehaviorSection.tsx": "React component that displays user behavior and engagement metrics including average session duration, bounce rate, page views, scroll depth zones, and event tracking in a card/table layout. Falls back to hardcoded demo values when real metrics are zero.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Tabbed analytics dashboard that fetches site analytics data (falling back to mock data) and renders sections for traffic, user behavior, SEO, performance, conversions, lead generation, trust metrics, search intent, technical reliability, and client retention.",
  "frontend/src/components/ClientCreateDeadlineForm.tsx": "Empty file with no content.",
  "frontend/src/components/ClientCreateFollowUpForm.tsx": "Form component that allows clients to create a follow-up item with title, description, due date, status, and notes, submitting via the useCreateClientFollowUp mutation hook.",
  "frontend/src/components/ClientCreateTimelineForm.tsx": "Form component for creating a client timeline entry with title, description, start/end dates, and status, validated and submitted via the useCreateClientTimeline mutation hook.",
  "frontend/src/components/ClientCreateToDoForm.tsx": "A form component that allows clients to create new To-Do items with title, description, priority, status, and optional file attachment, using the useCreateClientToDo mutation hook.",
  "frontend/src/components/ClientDeliverableForm.tsx": "A form component for clients to submit deliverables with a title, description, and file upload (supporting drag-and-drop), tracking upload progress and showing success/error toasts.",
  "frontend/src/components/ClientDeliverableTable.tsx": "Displays a table of the current client's submitted deliverables with status badges and approve/reject action buttons for compliance admins.",
  "frontend/src/components/ClientTasksTab.tsx": "A tabbed interface showing a client's To-Dos, Timelines, and Follow-Ups in separate tables, each with a dialog to create new items and inline status selects.",
  "frontend/src/components/ComplianceAdminDeadlineCountdown.tsx": "An empty file with no content or implementation.",
  "frontend/src/components/ComplianceAdminFollowUp.tsx": "Displays a table of all follow-up items for compliance admins, resolving client names from principals and providing inline status updates via FollowUpStatusSelect.",
  "frontend/src/components/ComplianceAdminTimeline.tsx": "Admin table component that displays all timeline entries with title, assigned client (resolved via principal lookup), start/end dates, and an inline status selector. Handles loading skeletons and empty/error states.",
  "frontend/src/components/ComplianceAdminToDoList.tsx": "Admin table component that lists all to-do items with title, assigned client, priority badge, status selector, downloadable document, and creation date. Includes a helper to download attached documents as blobs.",
  "frontend/src/components/ComplianceDocumentList.tsx": "Client-facing card that lists the current user's completed and approved deliverables with type label, date, status badge, and a download button. Shows skeletons while loading and an empty state when no documents exist.",
  "frontend/src/components/CreateDeadlineForm.tsx": "Empty file with no content.",
  "frontend/src/components/CreateFollowUpForm.tsx": "Form component for admins to create a new follow-up item, collecting title, description, due date, status, notes, and an optional client principal selected from approved users. Submits via the useCreateFollowUp mutation and resets on success.",
  "frontend/src/components/CreateTimelineForm.tsx": "Form component for admins to create a new timeline entry with title, description, start/end dates, status, and an optional client principal chosen from approved users. Converts dates to nanoseconds and submits via the useCreateTimeline mutation.",
  "frontend/src/components/CreateToDoForm.tsx": "A form component for creating new To-Do items with fields for title, description, priority, status, assigned client, and optional file attachment, using React Query mutations and toast notifications.",
  "frontend/src/components/DeliverableCard.tsx": "Displays a compliance deliverable as a card with status/type badges, due date urgency indicators, and placeholder approve/reject action buttons that currently show a 'coming soon' error.",
  "frontend/src/components/DocumentTable.tsx": "Renders a table of client documents with type badges, upload dates, and a download button that converts stored blob bytes into a browser file download.",
  "frontend/src/components/DocumentUploadForm.tsx": "A drag-and-drop file upload form that lets clients select a document type and upload a file to the backend, with upload progress tracking and approval-status error handling.",
  "frontend/src/components/EcwidWidget.tsx": "An empty component file with no content, likely a placeholder for an Ecwid e-commerce widget integration.",
  "frontend/src/components/Layout.tsx": "The main page layout wrapper that includes the Navigation component, a main content area, and a footer with brand info, social links, and quick navigation links.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing a loading spinner during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/MyComplianceTasksSection.tsx": "Displays a tabbed dashboard of the current user's compliance tasks (To-Dos, Timelines, Follow-Ups) with summary stats, status selectors, and dialogs for creating new items.",
  "frontend/src/components/Navigation.tsx": "Renders the top navigation bar with logo, desktop/mobile nav links, dropdown menus, and conditional admin/client-portal links based on authentication state and user role.",
  "frontend/src/components/PaymentForm.tsx": "Form component for submitting a payment request, supporting multiple currencies, payment methods, and card types, with validation and success/error feedback.",
  "frontend/src/components/PaymentHistoryTable.tsx": "Displays a paginated table of the authenticated user's past payments with amount, method, status badge, and date, including loading skeletons and an empty state.",
  "frontend/src/components/ProtectedRoute.tsx": "Wraps child routes to require Internet Identity authentication, showing a loading spinner during initialization or a login prompt if unauthenticated.",
  "frontend/src/components/ServiceRequestForm.tsx": "Form for submitting a new service request with service type, description, and deadline fields, using a mutation hook and toast notifications for feedback.",
  "frontend/src/components/TaskStatusSelect.tsx": "Provides three optimistic-update select components (ToDoStatusSelect, TimelineStatusSelect, FollowUpStatusSelect) that allow inline status changes for compliance tasks, timelines, and follow-ups with loading indicators and toast notifications.",
  "frontend/src/components/UserProfileSetup.tsx": "Renders a modal dialog that prompts newly authenticated users to complete their profile (name, email, company) on first login, blocking interaction until the form is submitted.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAnalytics.ts": "Provides two React Query hooks—useGetAnalyticsSummary and useGetNewAnalyticsSummary—that fetch analytics data from the backend actor, returning null gracefully if unavailable.",
  "frontend/src/hooks/useApprovals.ts": "Exports React Query hooks for listing approvals, setting approval status, checking if the caller is approved, and requesting approval, all backed by the ICP backend actor.",
  "frontend/src/hooks/useClientDeliverables.ts": "Provides React Query hooks for fetching, submitting, and updating client deliverables, including support for upload progress callbacks and submitting on behalf of a specific client principal.",
  "frontend/src/hooks/useComplianceAdmin.ts": "Exports React Query hooks for CRUD operations on compliance to-dos, timelines, and follow-ups, covering both admin (all records) and user-scoped (my records) queries.",
  "frontend/src/hooks/useDeliverables.ts": "Provides React Query hooks to fetch personal, pending, and all compliance deliverables, plus a mutation hook to create a new deliverable assigned to a client principal.",
  "frontend/src/hooks/useDocuments.ts": "Exports React Query hooks for fetching all client documents and uploading a new document (with type, name, MIME type, and file blob) to the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity state, and status flags to child components via a React context hook.",
  "frontend/src/hooks/usePayments.ts": "Provides React Query hooks for payment operations including fetching user/all payments, creating payments, updating payment status, and managing admin payment settings via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty placeholder file that notes feature-specific hooks are used instead of a centralized queries file.",
  "frontend/src/hooks/useServiceRequests.ts": "Provides React Query hooks for service request operations including fetching user/all requests, creating standard and visitor requests, and updating request status via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching the caller's user profile, looking up a profile by principal, and saving/updating the caller's user profile via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Lora and IBM Plex Sans fonts, configures Tailwind, and defines a dark-themed CSS variable design system with navy/gold accent colors for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider, InternetIdentityProvider, and the root App component.",
  "frontend/src/pages/AboutUsPage.tsx": "Static marketing page describing the firm's mission and core competencies (taxation, audit, accounting, financial administration) with a hero section and feature cards.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page wrapped in AdminGuard that displays tabbed views for managing service requests, documents, user approvals, payments, client deliverables, and analytics.",
  "frontend/src/pages/ClientPortalPage.tsx": "Authenticated client portal page with tabbed navigation for managing service requests, documents, payments, and deliverables filtered to the logged-in user's principal.",
  "frontend/src/pages/ComplianceAdminDashboardPage.tsx": "Admin dashboard page with three tabs (To-Do, Timeline, Follow-Up) for managing compliance tasks across all clients, each tab including a dialog form to create new entries.",
  "frontend/src/pages/ComplianceDashboardPage.tsx": "Client-facing compliance dashboard page with tabs for personal compliance tasks, deliverables, task deadlines, and documents, requiring authentication via Internet Identity.",
  "frontend/src/pages/HomePage.tsx": "Marketing home page displaying the company's services, stats, core principles, and testimonials with a hero section and social media links.",
  "frontend/src/pages/ServiceBookingPage.tsx": "Service booking page that renders a service request form alongside a sidebar explaining the review, consultation, and execution process.",
  "frontend/src/pages/VisitorServiceRequestPage.tsx": "Public-facing contact/enquiry page where unauthenticated visitors can submit a service request form with their details and preferred service type.",
  "frontend/src/utils/dateHelpers.ts": "Utility functions for working with nanosecond-precision timestamps, including calculating days remaining, formatting deadlines, and checking if a deadline is within five days.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the default theme with CSS variable-based color tokens, custom fonts (Lora, IBM Plex Sans), border radius, box shadows, and typography settings, plus the animate and typography plugins.",
  "project_state.json": "Tracks the FINPROLEDGE Portal project state (version 3), recording completed and pending navigation features that nest Compliance under Client Portal and Compliance Admin under the Admin menu."
}