{
  "backend/main.mo": "Main Motoko actor for the FINPROLEDGE backend, defining data types and state for service requests, client documents, compliance deliverables, payments, and user profiles, with CRUD operations and access-controlled query/update methods.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—document upload in the client portal and login details display in the admin approval tab—to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend source files, describing the purpose and notable changes of each component, page, and hook in the React application.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes, including colors for background, foreground, primary, sidebar, and chart variables.",
  "frontend/index.html": "HTML entry point for the FINPROLEDGE React app, mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root application component that sets up TanStack Router with routes for home, service booking, visitor request, client portal, compliance dashboard, and admin dashboard, wrapping appropriate routes with ProtectedRoute and including global UserProfileSetup and Toaster.",
  "frontend/src/components/AdminGuard.tsx": "Authorization guard component that restricts access to admin-only pages by verifying the authenticated user's email matches the hardcoded admin email, showing loading, login prompt, or access-denied states as appropriate.",
  "frontend/src/components/AdminPaymentSettings.tsx": "Admin-only form component for configuring the PayPal receiving email address, with validation, success/error feedback, and loading state, backed by useGetAdminPaymentSettings and useSetAdminPaymentSettings hooks.",
  "frontend/src/components/AdminPaymentTable.tsx": "Displays an admin table of all client payment records with status update controls, formatted amounts/dates, and a PayPal receiving account banner or warning if unconfigured.",
  "frontend/src/components/DeliverableCard.tsx": "Renders a card for a single compliance deliverable showing its title, type, due date, status badge, days remaining, and a warning highlight when due within 5 days.",
  "frontend/src/components/DocumentTable.tsx": "Renders a table of client documents with name, type badge, upload date, and a download button that opens the file's direct URL in a new tab.",
  "frontend/src/components/DocumentUploadForm.tsx": "Provides a drag-and-drop file upload form where clients select a document type and upload files, showing upload progress and success/error feedback.",
  "frontend/src/components/EcwidWidget.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Layout.tsx": "Wraps pages with a top Navigation bar and a footer containing company info, services, contact details, and a caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, showing a loading spinner during the login process and clearing the query cache on logout.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with logo, role-filtered nav links (public, authenticated, admin-only), user display name, login button, and a responsive mobile menu.",
  "frontend/src/components/PaymentForm.tsx": "A React form component for submitting payments, supporting multiple currencies, payment methods, and card types, with validation and success/error feedback via the useCreatePayment hook.",
  "frontend/src/components/PaymentHistoryTable.tsx": "Displays a paginated table of the current user's payment history with status badges, formatted amounts, and loading skeletons, fetched via useGetMyPayments.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated users to a login prompt and shows a loading spinner while Internet Identity initializes.",
  "frontend/src/components/ServiceRequestForm.tsx": "A form for submitting accounting/tax service requests with fields for phone, service type, description, and deadline, using the useCreateRequest mutation hook.",
  "frontend/src/components/UserProfileSetup.tsx": "A modal dialog that prompts newly authenticated users to complete their profile (name, email, company) before accessing the app, using useSaveCallerUserProfile.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useApprovals.ts": "Provides React Query hooks for listing approvals, setting approval status, checking if the caller is approved, and requesting approval via the backend actor.",
  "frontend/src/hooks/useDeliverables.ts": "Provides React Query hooks for fetching the caller's deliverables (all and pending), all deliverables globally, and mutating deliverable status via the backend actor.",
  "frontend/src/hooks/useDocuments.ts": "Provides React Query hooks for fetching all client documents and uploading new documents with a given type, name, and file blob via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status via an AuthClient wrapper.",
  "frontend/src/hooks/usePayments.ts": "Exports React Query hooks for payment operations including fetching user/all payments, creating payments, updating payment status, and managing admin payment settings.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty placeholder file that re-exports nothing, noting that feature-specific hooks are used instead.",
  "frontend/src/hooks/useServiceRequests.ts": "Exports React Query hooks for service request CRUD operations including fetching, creating (regular and visitor), and updating the status of service requests.",
  "frontend/src/hooks/useUserProfile.ts": "Exports React Query hooks for fetching and saving user profiles by caller, principal, or specific user, wrapping backend actor calls.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining Tailwind CSS base/utility layers with a deep navy and muted gold design token system supporting light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabbed views for managing service requests, documents, user approvals, and payments, including status update controls and client login detail display.",
  "frontend/src/pages/ClientPortalPage.tsx": "Client portal page with tabbed navigation for authenticated users to submit service requests, manage documents, and view/make payments.",
  "frontend/src/pages/ComplianceDashboardPage.tsx": "Displays a compliance dashboard showing total, pending, and completed deliverables with due-soon alerts and grouped deliverable cards fetched via custom hooks.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page featuring a hero section, service offerings, stats, and core principles for the FINPROLEDGE accounting firm.",
  "frontend/src/pages/ServiceBookingPage.tsx": "Authenticated service booking page that renders a ServiceRequestForm alongside a sidebar explaining the review, consultation, and execution workflow.",
  "frontend/src/pages/VisitorServiceRequestPage.tsx": "Public-facing form page allowing unauthenticated visitors to submit a service request with contact details, service type, and deadline, showing a confirmation state on success.",
  "frontend/src/utils/dateHelpers.ts": "Utility functions for converting nanosecond timestamps to days remaining, formatted date strings, and a due-soon check (within 5 days).",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with CSS-variable-based colors, Lora/IBM Plex Sans fonts, custom shadows, and the animate and typography plugins.",
  "project_state.json": "Defines project metadata, existing implemented features, and pending new feature requests for the FINPROLEDGE app, covering client document uploads and admin dashboard approval login details."
}