{
  "backend/main.mo": "Main actor for the FINPROLEDGE backend, defining all core types (ServiceRequest, ClientDocument, ComplianceDeliverable, PaymentRecord, analytics metrics, etc.) and mixing in authorization and blob storage functionality with migration support.",
  "backend/migration.mo": "Defines a migration module that carries over `userApprovalState` unchanged from the old actor shape to the new actor shape during canister upgrades.",
  "feature_evidence.json": "Feature evidence report mapping the AdminGuard email-restriction feature (finproledge@gmail.com) to its affected file (`Navigation.tsx`) and associated components and test IDs.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-sentence summaries of every frontend source file, serving as a reference index for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the FINPROLEDGE React SPA, mounting the app into `#root` and loading the TypeScript entry point.",
  "frontend/src/App.tsx": "Root application component that sets up TanStack Router with all page routes (home, service booking, client portal, compliance, compliance-admin, admin dashboard) and wraps the app in QueryClient and ThemeProvider.",
  "frontend/src/components/AdminClientDeliverableTable.tsx": "Admin table component that lists all client-submitted deliverables with status badges, submitter name/company lookup, and Accept/Reject action buttons with per-row loading state.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that restricts access to admin pages by checking the authenticated user's profile email against the hardcoded `finproledge@gmail.com`, showing loading, login-required, or access-denied states as appropriate.",
  "frontend/src/components/AdminPaymentSettings.tsx": "Admin-only form component for configuring the PayPal receiving email address, with validation, success/error alerts, and save functionality via a mutation hook.",
  "frontend/src/components/AdminPaymentTable.tsx": "Admin table component that displays all client payment records with status badges, payment method labels, and a dropdown to update payment status, plus a banner showing the configured PayPal account.",
  "frontend/src/components/analytics/ClientRetentionSection.tsx": "Analytics section that visualizes returning vs. new visitor ratios via a donut pie chart and displays a portal funnel drop-off table using static step data scaled by backend metrics.",
  "frontend/src/components/analytics/ConversionAnalysisSection.tsx": "Analytics section that prominently displays the overall conversion rate and renders a goal breakdown table showing visits, completions, and per-goal conversion rates for key user actions.",
  "frontend/src/components/analytics/LeadGenerationSection.tsx": "Renders a Lead Generation Analysis section displaying form submission rate, click-to-call count, and a lead quality breakdown table (high/medium/low) using card and table UI components.",
  "frontend/src/components/analytics/SearchIntentSection.tsx": "Shows a Search Intent & SEO section with local SEO keyword tracking, AI search visibility score, seasonal traffic bar chart, and a local keyword rankings table.",
  "frontend/src/components/analytics/SEOAnalysisSection.tsx": "Displays an SEO Analysis section with stat cards for SEO score, click-through rate, and backlink health, plus a keyword rankings table with position deltas and domain authority info.",
  "frontend/src/components/analytics/TechnicalPerformanceSection.tsx": "Renders a Technical Performance section displaying Core Web Vitals (LCP, INP, CLS) with ratings, a mobile-friendliness score, and an error monitoring table listing 404s and broken links.",
  "frontend/src/components/analytics/TechnicalReliabilitySection.tsx": "Displays a Technical Reliability section with three cards covering SSL/security score, mobile responsiveness score, and page load speed, each with color-coded badges and progress bars.",
  "frontend/src/components/analytics/TrafficAcquisitionSection.tsx": "Renders a traffic and acquisition analytics section with a bar chart for source/medium breakdown and a pie chart for new vs. returning visitors, plus a landing pages table. Falls back to hardcoded demo data when no real sources are provided.",
  "frontend/src/components/analytics/TrustMetricsSection.tsx": "Displays trust and authority metrics including average time on About/Team pages, testimonial click counts, and a blog article engagement table with hardcoded sample articles. Accepts a TrustMetrics data prop from the backend.",
  "frontend/src/components/analytics/UserBehaviorSection.tsx": "Shows user behavior and engagement stats (average session duration, bounce rate, page views, sessions) alongside scroll depth zones and an event tracking table. Falls back to hardcoded defaults when session metrics are zero.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Tabbed analytics dashboard that fetches site analytics data (falling back to mock data) and renders multiple sections including traffic, SEO, conversions, lead generation, and technical performance.",
  "frontend/src/components/ClientDeliverableForm.tsx": "Form component allowing clients to upload a file deliverable with a title and description, supporting drag-and-drop, upload progress tracking, and submission via a mutation hook.",
  "frontend/src/components/ClientDeliverableTable.tsx": "Read-only table component that displays a client's submitted deliverables with their title, description, submission date, and review status badge.",
  "frontend/src/components/ComplianceAdminDeadlineCountdown.tsx": "Displays a sorted table of all upcoming compliance deliverable deadlines (excluding approved/rejected), highlighting items due within 5 days with a critical alert banner.",
  "frontend/src/components/ComplianceAdminFollowUp.tsx": "Shows a table of compliance deliverables stuck in 'Drafting' or 'In Review' status, alerting admins to items that need follow-up action.",
  "frontend/src/components/ComplianceAdminTimeline.tsx": "Renders a monthly workload bar chart and a Gantt-style individual task timeline for all compliance deliverables, grouped and color-coded by status.",
  "frontend/src/components/ComplianceAdminToDoList.tsx": "Provides a searchable, filterable, and sortable table of all compliance deliverables for admins, with controls for status filtering and column sorting.",
  "frontend/src/components/ComplianceDocumentList.tsx": "Displays a list of the current user's completed and approved compliance documents, showing type, date, and status badges with a download button placeholder.",
  "frontend/src/components/DeliverableCard.tsx": "Renders a card UI for a compliance deliverable showing status, due date, urgency indicators, and approve/reject action buttons (currently stubbed as backend methods are not yet available).",
  "frontend/src/components/DocumentTable.tsx": "Displays a table of client documents with name, type badge, upload date, and a download button that opens the file's direct URL.",
  "frontend/src/components/DocumentUploadForm.tsx": "Provides a drag-and-drop file upload form with document type selection, upload progress tracking, and success/error feedback using the useUploadDocument hook.",
  "frontend/src/components/EcwidWidget.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Layout.tsx": "Wraps page content with a sticky Navigation header and a footer containing company info, services list, contact details, and a caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, showing a loading spinner during login and clearing the React Query cache on logout.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with responsive desktop/mobile menus, dynamic links based on authentication state, and admin-only links shown when the user's email matches the admin address.",
  "frontend/src/components/PaymentForm.tsx": "Form component for submitting payments with amount, multi-currency selection, payment method, and optional card type fields, using the useCreatePayment hook and displaying success/error feedback.",
  "frontend/src/components/PaymentHistoryTable.tsx": "Displays a paginated table of the current user's payment history, including reference number, amount, payment method, status badge, and date, with loading skeletons and an empty state.",
  "frontend/src/components/ProtectedRoute.tsx": "Wraps child routes to require Internet Identity authentication, showing a spinner while initializing and a login prompt with navigation options if unauthenticated.",
  "frontend/src/components/ServiceRequestForm.tsx": "Form component that lets authenticated users submit a service request by selecting a service type, entering a description, phone number, and deadline, then calling the createRequest mutation.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that appears for authenticated users who have no profile, prompting them to enter their name, email, and company to complete initial setup via the saveProfile mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an Internet Computer actor (authenticated or anonymous) using React Query, initializing access control with an admin token when authenticated. Invalidates and refetches all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAnalytics.ts": "Provides two React Query hooks—useGetAnalyticsSummary and useGetNewAnalyticsSummary—that fetch analytics data from the backend actor, returning null gracefully on failure or when the actor is unavailable.",
  "frontend/src/hooks/useApprovals.ts": "Exports React Query hooks for listing approvals, setting a user's approval status, checking if the caller is approved, and requesting approval, all backed by the backend actor with cache invalidation on mutations.",
  "frontend/src/hooks/useClientDeliverables.ts": "Provides hooks to fetch the current user's submitted deliverables, fetch all client deliverables, submit a new deliverable, and update a deliverable's status, with query invalidation on mutations.",
  "frontend/src/hooks/useDeliverables.ts": "Exports hooks for fetching a user's own deliverables, pending deliverables, all compliance deliverables, and creating a new deliverable assigned to a client principal, with appropriate cache invalidation.",
  "frontend/src/hooks/useDocuments.ts": "Provides hooks to fetch all client documents and upload a new document (with type, name, and file blob) to the backend actor, invalidating the documents cache on successful upload.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/usePayments.ts": "Exports React Query hooks for payment operations including fetching user/all payments, creating payments, updating payment status, and managing admin payment settings.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file that re-exports nothing, noting that feature-specific hooks are used instead.",
  "frontend/src/hooks/useServiceRequests.ts": "Exports React Query hooks for service request CRUD operations including fetching, creating (regular and visitor), and updating the status of service requests.",
  "frontend/src/hooks/useUserProfile.ts": "Exports React Query hooks for fetching the caller's user profile, looking up a profile by principal, and saving/updating the caller's user profile.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind, and defines CSS custom properties for a deep navy/gold design system with light and dark mode themes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabbed views for managing service requests, documents, user approvals, payments, deliverables, and analytics, protected by an AdminGuard component.",
  "frontend/src/pages/ClientPortalPage.tsx": "Client portal page with tabbed navigation for authenticated users to manage their service requests, documents, payments, and deliverables.",
  "frontend/src/pages/ComplianceAdminDashboardPage.tsx": "Admin-only dashboard page with four tabs (To-Do List, Timeline, Follow-Up, Deadlines) that compose the corresponding ComplianceAdmin* components, wrapped in an AdminGuard.",
  "frontend/src/pages/ComplianceDashboardPage.tsx": "Client-facing compliance dashboard showing deliverable stats, urgent deadline alerts, and tabbed views for tasks and documents using the useGetMyDeliverables hook.",
  "frontend/src/pages/HomePage.tsx": "Public marketing home page featuring a hero section, service cards, stats banner, and core principles for the FINPROLEDGE accounting firm.",
  "frontend/src/pages/ServiceBookingPage.tsx": "Authenticated service booking page that renders the ServiceRequestForm alongside a sidebar explaining the review, consultation, and execution process.",
  "frontend/src/pages/VisitorServiceRequestPage.tsx": "Public service request form for unauthenticated visitors to submit their name, company, service type, and deadline, with a success confirmation state after submission.",
  "frontend/src/utils/dateHelpers.ts": "Utility functions for converting nanosecond timestamps to days remaining, formatted date strings, and checking whether a deadline falls within five days.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom CSS-variable-based colors, serif/sans font families (Lora, IBM Plex Sans), border radii, box shadows, and typography styles. Includes the tailwindcss-animate and @tailwindcss/typography plugins.",
  "project_state.json": "Tracks the current state of the FINPROLEDGE Portal project, recording existing features, pending admin-access restriction requests, and architectural notes that limit admin access exclusively to finproledge@gmail.com."
}