{
  "backend/main.mo": "Main Motoko actor defining all core data types (ServiceRequest, ClientDocument, ComplianceDeliverable, PaymentRecord, etc.) and mixing in authorization and blob-storage functionality for the FINPROLEDGE financial services platform.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features — a multi-format admin download options menu and removal of specific marketing stats — to their relevant frontend files and components.",
  "frontend-file-summaries.txt": "Auto-generated JSON index providing one-line summaries of every frontend source file, describing each component's role, recent changes, and key behaviors.",
  "frontend/index.css": "Global Tailwind CSS entry point defining light and dark mode CSS custom properties (design tokens) for colors, borders, charts, and sidebar used throughout the app.",
  "frontend/index.html": "Minimal HTML shell titled 'FINPROLEDGE' that mounts the React app at the `#root` div via the `main.tsx` module entry point.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with all page routes (including protected routes for client portal, admin, compliance, and compliance-admin), wraps the app in QueryClientProvider and ThemeProvider.",
  "frontend/src/components/AdminClientDeliverableTable.tsx": "Admin table component for viewing, approving/rejecting, and submitting client deliverables, featuring a DownloadOptionsMenu for bulk export and a dialog form for admins to upload deliverables on behalf of clients.",
  "frontend/src/components/AdminGuard.tsx": "A route guard component that restricts access to admin-only pages by checking Internet Identity authentication and verifying the user's email matches a hardcoded admin email, showing appropriate loading/error/denied states otherwise.",
  "frontend/src/components/AdminPaymentSettings.tsx": "A form component for admins to configure and save the PayPal receiving email address for client payments, with validation, loading states, and success/error feedback.",
  "frontend/src/components/AdminPaymentTable.tsx": "Displays a table of all client payment records with status badges and a dropdown to update payment status, also showing the configured PayPal receiving account or a warning if none is set.",
  "frontend/src/components/analytics/ClientRetentionSection.tsx": "Displays client retention analytics including a pie chart of returning vs. new visitors and a portal funnel drop-off table derived from ClientRetentionMetrics data. Uses Recharts for visualization.",
  "frontend/src/components/analytics/ConversionAnalysisSection.tsx": "Renders a conversion and goal analysis section showing an overall conversion rate in a prominent card and a breakdown table of individual goal completions (form submissions, sign-ups, uploads). Accepts a ConversionRate prop for dynamic data.",
  "frontend/src/components/analytics/LeadGenerationSection.tsx": "Displays lead generation metrics including form submission counts with a progress bar, click-to-call counts, and a lead quality breakdown table categorized as high, medium, and low value. Derives display values from the LeadGenerationMetrics backend type.",
  "frontend/src/components/analytics/SearchIntentSection.tsx": "React component showing local SEO keyword rankings, seasonal traffic trends via a bar chart, and AI search engine visibility score using SearchIntentMetrics data.",
  "frontend/src/components/analytics/SEOAnalysisSection.tsx": "React component that displays an SEO analysis dashboard with stat cards for SEO score, click-through rate, and backlink health, plus a keyword rankings table with position deltas.",
  "frontend/src/components/analytics/TechnicalPerformanceSection.tsx": "React component that visualizes Core Web Vitals (LCP, INP, CLS), mobile-friendliness score, and an error monitoring table with 404s and broken links.",
  "frontend/src/components/analytics/TechnicalReliabilitySection.tsx": "React component displaying SSL/security status, mobile responsiveness score, and page load speed using TechnicalReliabilityMetrics, with color-coded badges and progress bars.",
  "frontend/src/components/analytics/TrafficAcquisitionSection.tsx": "React component that renders traffic acquisition analytics including a source/medium bar chart, new vs. returning visitors pie chart, and a top landing pages table.",
  "frontend/src/components/analytics/TrustMetricsSection.tsx": "React component that displays trust and authority metrics for a financial services site, including average time on About/Team pages, review/testimonial clicks, blog engagement, and a table of top blog articles by reads.",
  "frontend/src/components/analytics/UserBehaviorSection.tsx": "React component that renders user behavior and engagement analytics, showing stat cards for average session duration, bounce rate, page views, and sessions, along with scroll depth zones and an event tracking table.",
  "frontend/src/components/AnalyticsDashboard.tsx": "A tabbed analytics dashboard that fetches site analytics data (falling back to mock data) and renders multiple sections covering traffic, SEO, conversions, lead generation, and other metrics.",
  "frontend/src/components/ClientCreateDeadlineForm.tsx": "An empty file with no content.",
  "frontend/src/components/ClientCreateFollowUpForm.tsx": "A form component that allows clients to create follow-up items with a title, description, due date, status, and notes, submitting via the useCreateClientFollowUp hook.",
  "frontend/src/components/ClientCreateTimelineForm.tsx": "A form component for clients to create timeline entries with a title, description, start/end dates, and status, with date validation and submission via the useCreateClientTimeline hook.",
  "frontend/src/components/ClientCreateToDoForm.tsx": "A form component for clients to create new To-Do items with title, description, priority, status, and optional file attachment fields, using the useCreateClientToDo mutation hook.",
  "frontend/src/components/ClientDeliverableForm.tsx": "A form component that allows clients to submit deliverables by uploading a file with a title and description, showing upload progress and success/error feedback via toasts.",
  "frontend/src/components/ClientDeliverableTable.tsx": "A table component that displays a client's submitted deliverables with their status badges and allows admins to approve or reject each deliverable.",
  "frontend/src/components/ClientTasksTab.tsx": "A tabbed interface component displaying a client's To-Dos, Timelines, and Follow-Ups in separate tables, with dialogs to create new items for each category.",
  "frontend/src/components/ComplianceAdminDeadlineCountdown.tsx": "An empty file with no content.",
  "frontend/src/components/ComplianceAdminFollowUp.tsx": "A table component for compliance admins to view all follow-up items, displaying client names (resolved from principals), due dates, notes, and an inline status selector.",
  "frontend/src/components/ComplianceAdminTimeline.tsx": "Admin table component that displays all timeline entries with title, assigned client (resolved via principal lookup), date range, and an inline status selector. Handles loading skeletons and empty/error states.",
  "frontend/src/components/ComplianceAdminToDoList.tsx": "Admin to-do list table showing all tasks with priority/status badges, client name resolution, document download support, and a dialog for creating new to-do items with CSV/ZIP export options.",
  "frontend/src/components/ComplianceDocumentList.tsx": "Client-facing card component that lists the current user's completed and approved deliverables with type labels, dates, status badges, and download buttons.",
  "frontend/src/components/CreateDeadlineForm.tsx": "Empty file with no content.",
  "frontend/src/components/CreateFollowUpForm.tsx": "Form component for admins to create a follow-up item, collecting title, description, due date, status, notes, and an optional client principal selected from approved clients.",
  "frontend/src/components/CreateTimelineForm.tsx": "Form component for admins to create a timeline entry with title, description, start/end dates, status, and an optional assigned client principal chosen from approved clients.",
  "frontend/src/components/CreateToDoForm.tsx": "A form component for creating To-Do items with fields for title, description, priority, status, assigned client, and optional file attachment, using React Query mutations and toast notifications.",
  "frontend/src/components/DeliverableCard.tsx": "A card component that displays a compliance deliverable's details including status, type, due date, and urgency indicators, with placeholder approve/reject mutation buttons that are not yet backend-supported.",
  "frontend/src/components/DocumentTable.tsx": "A table component that lists client documents with type badges, upload dates, and per-row download functionality, supporting both admin and client modes with export options via DownloadOptionsMenu.",
  "frontend/src/components/DocumentUploadForm.tsx": "A form component for uploading client documents with document type selection, drag-and-drop file input, upload progress tracking, and approval status handling.",
  "frontend/src/components/DownloadOptionsMenu.tsx": "A dropdown menu component offering multiple export formats (PDF, XLSX, DOCX, CSV, ZIP, image) for table data or file blobs, with per-format loading state management.",
  "frontend/src/components/EcwidWidget.tsx": "An empty file with no content.",
  "frontend/src/components/Layout.tsx": "Defines the main page layout wrapper with a sticky Navigation header, main content slot, and a footer containing brand info, social links, and quick navigation links.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, showing a loading spinner during login and clearing the React Query cache on logout.",
  "frontend/src/components/MyComplianceTasksSection.tsx": "Displays a tabbed dashboard of the current user's compliance tasks (To-Dos, Timelines, Follow-Ups) with summary stats, status selectors, and dialogs for creating new items.",
  "frontend/src/components/Navigation.tsx": "Renders the top navigation bar with logo, desktop dropdown menus, mobile menu, and conditional links for authenticated users and admins, including a LoginButton.",
  "frontend/src/components/PaymentForm.tsx": "Provides a form for submitting payment requests with fields for amount, currency, payment method, and card type, using the useCreatePayment hook and displaying success/error feedback.",
  "frontend/src/components/PaymentHistoryTable.tsx": "Fetches and displays the current user's payment history in a table with columns for reference number, amount, payment method, status badge, and date.",
  "frontend/src/components/ProtectedRoute.tsx": "Wraps child routes to enforce authentication, showing a loading spinner during initialization and a login prompt with navigation options when the user is unauthenticated.",
  "frontend/src/components/ServiceRequestForm.tsx": "A form component that allows authenticated users to submit service requests by selecting a service type, entering a description, and choosing a deadline. Uses the useCreateRequest hook to persist the request and shows toast notifications on success or failure.",
  "frontend/src/components/TaskStatusSelect.tsx": "Provides three optimistic-update select components (ToDoStatusSelect, TimelineStatusSelect, FollowUpStatusSelect) for updating the status of to-dos, timeline items, and follow-ups respectively, with loading indicators and toast feedback.",
  "frontend/src/components/UserProfileSetup.tsx": "A modal dialog that appears for authenticated users who have not yet created a profile, prompting them to enter their name, email, and company name before proceeding. Calls useSaveCallerUserProfile to persist the profile on submission.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAnalytics.ts": "Custom React hooks that fetch analytics data from the backend actor, providing both a legacy `getAnalyticsSummary` query and a newer `getNewAnalyticsSummary` query returning lead generation, trust, search intent, technical reliability, and client retention metrics.",
  "frontend/src/hooks/useApprovals.ts": "Custom React hooks for managing user approval workflows, exposing queries to list approvals and check caller approval status, and mutations to set approval or request approval via the backend actor.",
  "frontend/src/hooks/useClientDeliverables.ts": "Custom React hooks for client deliverable operations, including fetching own and all deliverables, submitting deliverables (with optional upload progress), submitting on behalf of a client, and updating deliverable status.",
  "frontend/src/hooks/useComplianceAdmin.ts": "Custom React hooks for compliance administration, providing queries and mutations for managing to-dos, timelines, and follow-ups for both admin (all records) and client (own records) views.",
  "frontend/src/hooks/useDeliverables.ts": "Custom React hooks for compliance deliverables, exposing queries to fetch a user's own, pending, or all deliverables, and a mutation to create a new deliverable assigned to a client principal.",
  "frontend/src/hooks/useDocuments.ts": "Custom React hooks for document management, providing a query to fetch all client documents and a mutation to upload a new document with type, name, MIME type, and file blob.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state and persisting identity via AuthClient with configurable options.",
  "frontend/src/hooks/usePayments.ts": "Custom React Query hooks for payment operations including fetching user/all payments, creating payments, updating payment status, and managing admin payment settings.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file that re-exports nothing, noting that feature-specific hooks are used instead.",
  "frontend/src/hooks/useServiceRequests.ts": "Custom React Query hooks for service request CRUD operations including fetching, creating, and updating the status of service requests via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Custom React Query hooks for fetching and saving user profiles by caller or principal, wrapping backend actor calls with caching and invalidation logic.",
  "frontend/src/index.css": "Global stylesheet defining a dark-themed design system with CSS custom properties for colors, typography using Lora and IBM Plex Sans fonts, and Tailwind base/component/utility layers.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutUsPage.tsx": "Static marketing page describing the company's mission and core competencies (taxation, audit, accounting, financial administration) with a hero section and feature cards.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabbed views for managing service requests, documents, user approvals, payments, deliverables, and analytics, protected by an AdminGuard component.",
  "frontend/src/pages/ClientPortalPage.tsx": "Client portal page with tabbed navigation for managing service requests, documents (upload/view), payments, and deliverables, filtered to the authenticated user's principal.",
  "frontend/src/pages/ComplianceAdminDashboardPage.tsx": "Admin dashboard page for compliance management with tabs for To-Dos, Timelines, and Follow-Ups, each with a dialog-based creation form.",
  "frontend/src/pages/ComplianceDashboardPage.tsx": "Compliance dashboard for authenticated users with tabs for viewing/managing compliance tasks, deliverables, task deadlines, and documents.",
  "frontend/src/pages/HomePage.tsx": "Public marketing homepage displaying services, company principles, testimonials, and stats for the FinProLedge accounting firm.",
  "frontend/src/pages/ServiceBookingPage.tsx": "Public service booking page that renders the ServiceRequestForm alongside a sidebar explaining the review, consultation, and execution process.",
  "frontend/src/pages/VisitorServiceRequestPage.tsx": "Public contact/enquiry page where unauthenticated visitors can submit a service request form with name, email, company, and service type details.",
  "frontend/src/utils/dateHelpers.ts": "Utility functions for working with nanosecond timestamps: calculating days remaining, formatting deadlines, and checking if a deadline is within 5 days.",
  "frontend/src/utils/fileExport.ts": "Provides client-side file export utilities using browser-native APIs to download table data as CSV, XLSX (SpreadsheetML XML), or DOCX (HTML-based Word-compatible) files via programmatic anchor clicks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both regular and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with CSS-variable-based color tokens, custom fonts (Lora, IBM Plex Sans), border radii, box shadows, and typography settings, plus animate and typography plugins.",
  "project_state.json": "Tracks the FINPROLEDGE Portal project state at version 3, listing two existing features (admin download menu, UI text removal) and two corresponding pending action requests."
}