{
  "backend/main.mo": "Main Motoko actor defining all backend types (ServiceRequest, ClientDocument, ComplianceDeliverable, PaymentRecord, analytics metrics, etc.) and including authorization and blob-storage mixins for a financial services platform.",
  "feature_evidence.json": "Feature evidence report mapping a single feature (inline status-change controls in ClientTasksTab) to its implementation file, component dependencies, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of every frontend source file, serving as a reference index for the project's React components, pages, and hooks.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, chart palette, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell titled 'FINPROLEDGE' that mounts the React app at the `#root` div and loads the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Root React application component that configures TanStack Router with all page routes (home, service booking, client portal, compliance, compliance-admin, admin dashboard) and wraps the app in QueryClient, ThemeProvider, and Toaster providers.",
  "frontend/src/components/AdminClientDeliverableTable.tsx": "Admin table component that lists all client-submitted deliverables with status badges and Accept/Reject action buttons, resolving client names from their Principal via a profile lookup hook.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that restricts access to admin areas by checking the authenticated user's profile email against the hardcoded admin email, showing loading, login prompt, or access-denied states as appropriate.",
  "frontend/src/components/AdminPaymentSettings.tsx": "Admin-only form component for configuring the PayPal receiving email address, with validation, success/error alerts, and loading state.",
  "frontend/src/components/AdminPaymentTable.tsx": "Displays a table of all client payment records with status badges, payment method labels, and inline status update controls; also shows the configured PayPal receiving account.",
  "frontend/src/components/analytics/ClientRetentionSection.tsx": "Analytics section that visualizes client retention metrics with a donut pie chart comparing returning vs. new visitors and a funnel table showing portal drop-off rates at each step.",
  "frontend/src/components/analytics/ConversionAnalysisSection.tsx": "Renders a Conversion & Goal Analysis section showing an overall conversion rate card and a breakdown table of goal completions (form submissions, sign-ups, etc.) with calculated rates.",
  "frontend/src/components/analytics/LeadGenerationSection.tsx": "Displays a Lead Generation Analysis section with cards for form submission rate and click-to-call counts, plus a table breaking down leads by quality tier (high/medium/low).",
  "frontend/src/components/analytics/SearchIntentSection.tsx": "Renders a Search Intent & SEO section tracking local SEO keyword rankings, AI search visibility score, and a seasonal traffic bar chart with tax-deadline highlights.",
  "frontend/src/components/analytics/SEOAnalysisSection.tsx": "Shows an SEO Analysis section with stat cards for SEO score, click-through rate, and backlink health, plus a keyword rankings table with position deltas.",
  "frontend/src/components/analytics/TechnicalPerformanceSection.tsx": "Displays Core Web Vitals (LCP, INP, CLS) with ratings, a mobile-friendliness score, and an error monitoring table listing 404s and broken links.",
  "frontend/src/components/analytics/TechnicalReliabilitySection.tsx": "React component that displays technical reliability metrics (SSL status, mobile responsiveness score, and page load speed) using color-coded cards with progress bars and badges.",
  "frontend/src/components/analytics/TrafficAcquisitionSection.tsx": "React component that visualizes traffic acquisition data including source/medium breakdown via a bar chart, new vs. returning visitors via a pie chart, and top landing pages in a table.",
  "frontend/src/components/analytics/TrustMetricsSection.tsx": "React component that displays trust and authority metrics including average time on About/Team pages, testimonial click counts, and a table of top blog articles by read count.",
  "frontend/src/components/analytics/UserBehaviorSection.tsx": "React component that shows user behavior and engagement metrics including average session duration, bounce rate, page views, sessions, scroll depth zones, and an event tracking table.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Tabbed analytics dashboard that fetches site analytics data (falling back to mock data) and renders sections for traffic, user behavior, SEO, performance, conversions, leads, trust, search intent, reliability, and retention.",
  "frontend/src/components/ClientCreateDeadlineForm.tsx": "Form component allowing clients to create a compliance deadline with title, description, due date, urgency level, and status fields, submitting via the useCreateClientDeadline hook.",
  "frontend/src/components/ClientCreateFollowUpForm.tsx": "Form component for creating a client follow-up item with title, description, due date, status, and notes fields, submitting via the useCreateClientFollowUp hook.",
  "frontend/src/components/ClientCreateTimelineForm.tsx": "A form component for creating a new client timeline entry with fields for title, description, start/end dates, and status. Validates inputs, converts dates to nanoseconds, and submits via the `useCreateClientTimeline` mutation hook.",
  "frontend/src/components/ClientCreateToDoForm.tsx": "A form component for creating a new client to-do item with title, description, priority, and status fields. Submits via the `useCreateClientToDo` mutation hook and shows toast notifications on success.",
  "frontend/src/components/ClientDeliverableForm.tsx": "A file upload form that allows clients to submit deliverables with a title, description, and file attachment supporting drag-and-drop. Converts the file to bytes using `ExternalBlob` and submits via the `useSubmitClientDeliverable` mutation hook with upload progress tracking.",
  "frontend/src/components/ClientDeliverableTable.tsx": "Displays a table of the current client's submitted deliverables with their title, description, submission date, and status badge. Fetches data via `useGetMyClientDeliverables` and shows loading skeletons or an empty state as appropriate.",
  "frontend/src/components/ClientTasksTab.tsx": "A tabbed dashboard component that displays four sections—To-Dos, Timelines, Follow-Ups, and Deadlines—each with a data table, loading/empty states, status-change dropdowns, and a dialog form for creating new entries. Fetches data from corresponding compliance admin hooks and renders priority/urgency badges.",
  "frontend/src/components/ComplianceAdminDeadlineCountdown.tsx": "Admin dashboard component that displays countdown timers for compliance deliverables and deadline records, sorted by due date, with a dialog to create new deadlines. Shows urgency levels, deadline statuses, and resolves client principal IDs to names.",
  "frontend/src/components/ComplianceAdminFollowUp.tsx": "Admin component that lists 'stuck' compliance deliverables (in drafting or review) alongside follow-up tracking items, with a dialog to create new follow-up entries. Displays days overdue and follow-up statuses with color-coded badges.",
  "frontend/src/components/ComplianceAdminTimeline.tsx": "Admin timeline component that groups compliance deliverables by month across a 6-month window and renders a bar-chart-style overview alongside a table of admin-created timeline records. Supports creating new timeline entries via a dialog.",
  "frontend/src/components/ComplianceAdminToDoList.tsx": "Admin to-do list component that combines compliance deliverables with admin-created to-do items, supporting search, sort, and priority/status filtering. Includes a dialog for creating new to-do entries and resolves client principals to display names.",
  "frontend/src/components/ComplianceDocumentList.tsx": "Client-facing component that lists the current user's completed and approved compliance deliverables as downloadable documents, with type badges and completion dates. Shows an empty state when no documents exist.",
  "frontend/src/components/CreateDeadlineForm.tsx": "A form component for creating compliance deadline records with fields for title, description, due date, urgency level, status, and optional deliverable reference. Submits via the `useCreateDeadline` mutation hook and shows success/error alerts.",
  "frontend/src/components/CreateFollowUpForm.tsx": "A form component for creating follow-up items with fields for title, description, due date, client principal ID, status, and notes. Validates input including Principal format and submits via the `useCreateFollowUp` mutation hook.",
  "frontend/src/components/CreateTimelineForm.tsx": "A form component for creating timeline entries with title, description, start/end dates, status, and optional task reference fields. Validates date ordering and submits via the `useCreateTimeline` mutation hook.",
  "frontend/src/components/CreateToDoForm.tsx": "A form component for creating To-Do items with title, description, priority, status, and optional assigned client principal fields. Submits via the `useCreateToDo` mutation hook with Principal validation.",
  "frontend/src/components/DeliverableCard.tsx": "A card component that displays a compliance deliverable's status, type, due date, and urgency indicators. Includes placeholder approve/reject mutation buttons that currently surface a 'coming soon' toast since the backend method is not yet available.",
  "frontend/src/components/DocumentTable.tsx": "A table component that lists client documents with their name, type badge, upload date, and a download button that opens the file's direct URL in a new tab.",
  "frontend/src/components/DocumentUploadForm.tsx": "A React form component that allows users to upload financial documents (PDF, XLSX, etc.) by selecting a document type and file via drag-and-drop or file picker, then submitting it with upload progress tracking.",
  "frontend/src/components/EcwidWidget.tsx": "An empty component file with no content.",
  "frontend/src/components/Layout.tsx": "A layout wrapper component that renders the Navigation header, main content area, and a footer with company info, services, and contact details for FINPROLEDGE.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading/authenticated states and clearing the React Query cache on logout.",
  "frontend/src/components/MyComplianceTasksSection.tsx": "A tabbed dashboard section displaying a client's compliance tasks (to-dos, timelines, follow-ups, deadlines) with status update controls and dialogs for creating new items.",
  "frontend/src/components/Navigation.tsx": "A sticky navigation bar with responsive desktop/mobile menus, showing authenticated-only links (Client Portal, Compliance) and admin-only links (Admin Dashboard, Compliance Admin) based on user profile.",
  "frontend/src/components/PaymentForm.tsx": "A payment form component supporting multiple currencies and payment methods (credit/debit card, PayPal, Apple Pay, Google Pay), with card type selection and amount validation before submitting via a mutation hook.",
  "frontend/src/components/PaymentHistoryTable.tsx": "Displays a paginated table of the current user's payment history with status badges, formatted amounts, and payment method labels, fetched via the useGetMyPayments hook.",
  "frontend/src/components/ProtectedRoute.tsx": "Wraps child routes to require Internet Identity authentication, showing a loading spinner during initialization or a login prompt if unauthenticated.",
  "frontend/src/components/ServiceRequestForm.tsx": "Form component that lets authenticated users submit a service request by selecting a service type, entering a description, deadline, and phone number, then calling the useCreateRequest mutation.",
  "frontend/src/components/TaskStatusSelect.tsx": "Exports four inline select components (ToDo, Timeline, FollowUp, Deadline) that allow admins to update compliance task statuses via their respective mutation hooks with toast feedback.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that appears for authenticated users who have no saved profile, prompting them to enter their name, email, and company before calling useSaveCallerUserProfile.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAnalytics.ts": "Custom React hooks that fetch analytics data from the backend actor, providing both a legacy `getAnalyticsSummary` and a newer `getNewAnalyticsSummary` query via React Query.",
  "frontend/src/hooks/useApprovals.ts": "Custom React hooks for managing user approval workflows, including listing approvals, setting approval status, checking caller approval, and requesting approval via React Query mutations.",
  "frontend/src/hooks/useClientDeliverables.ts": "Custom React hooks for managing client deliverables, supporting fetching personal and all deliverables, submitting new ones, and updating their status via React Query.",
  "frontend/src/hooks/useComplianceAdmin.ts": "Provides React Query hooks for admin-level CRUD operations on compliance entities: to-dos, timelines, follow-ups, and deadlines, all backed by an ICP actor.",
  "frontend/src/hooks/useDeliverables.ts": "Provides React Query hooks to fetch (own, pending, all) and create compliance deliverables via the ICP actor.",
  "frontend/src/hooks/useDocuments.ts": "Provides React Query hooks to fetch all client documents and upload new documents via the ICP actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity, and status state to child components.",
  "frontend/src/hooks/usePayments.ts": "Provides React Query hooks for creating, fetching, and updating payment records and admin payment settings via the ICP actor.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file that delegates query logic to feature-specific hook files.",
  "frontend/src/hooks/useServiceRequests.ts": "Provides React Query hooks to create, fetch, and update the status of service requests (including visitor requests) via the ICP actor.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks to get the caller's profile, look up a profile by principal, and save/update the caller's user profile via the ICP actor.",
  "frontend/src/index.css": "Defines global CSS custom properties for a deep-navy/gold design system (light and dark modes), imports Google Fonts, and sets base typography and utility styles using Tailwind.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for managing service requests, documents, user approvals, payments, client deliverables, and analytics, protected by AdminGuard.",
  "frontend/src/pages/ClientPortalPage.tsx": "Client-facing portal page with tabbed navigation for service requests, document upload/viewing, payments, and deliverables, filtered to the authenticated user's data.",
  "frontend/src/pages/ComplianceAdminDashboardPage.tsx": "Admin-only compliance dashboard with four tabs: To-Do List, Timeline, Follow-Up, and Deadline Countdown, each rendered by a dedicated compliance admin component.",
  "frontend/src/pages/ComplianceDashboardPage.tsx": "Client-facing compliance dashboard showing deliverable stats, urgent deadline alerts, and tabbed sections for tasks, deliverables, and documents.",
  "frontend/src/pages/HomePage.tsx": "Public marketing homepage featuring a hero section, service offerings, stats banner, and core principles for the FINPROLEDGE accounting firm.",
  "frontend/src/pages/ServiceBookingPage.tsx": "Public service booking page that renders the ServiceRequestForm alongside a sidebar explaining the review, consultation, and execution process.",
  "frontend/src/pages/VisitorServiceRequestPage.tsx": "A public-facing page that renders a service request form for visitors, collecting name, email, company, phone, service type, description, and deadline, then submitting via the useCreateVisitorRequest mutation hook with a success confirmation card on completion.",
  "frontend/src/utils/dateHelpers.ts": "Utility functions for working with nanosecond-precision Time values: calculating days remaining until a deadline, formatting a timestamp as a readable date string, and checking if a deadline is within 5 days.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both regular query strings and hash-based routes, using sessionStorage for cross-navigation persistence and history.replaceState to strip sensitive params from the address bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the default theme with CSS-variable-based color tokens, Lora/IBM Plex Sans font families, custom border radii, box shadows, and typography settings, with the animate and typography plugins enabled.",
  "project_state.json": "Project state metadata describing the FINPROLEDGE Compliance app's current features and pending action requests, primarily focused on adding inline status-change controls for client task types (To-Dos, Timelines, Follow-Ups, Deadlines) across the compliance dashboard and client portal."
}