{
  "backend/main.mo": "Main actor for the FINPROLEDGE backend, defining data types and state for service requests, client documents, compliance deliverables, payment records, and user profiles, with role-based access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that transforms old payment records (with `#stripe` method and `currency` field) and admin payment accounts into the new schema supporting multiple payment methods, `currencyCode`, `cardType`, and simplified `adminPaymentSettings`.",
  "feature_evidence.json": "Feature evidence report mapping three payment-related features (card method support with currency selection, PayPal-only admin settings, and enhanced admin payment table display) to their implementing frontend files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated documentation file containing one- to two-sentence summaries of each frontend source file, describing the purpose and recent changes of components, pages, and hooks.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.) used throughout the application.",
  "frontend/index.html": "Minimal HTML shell for the FINPROLEDGE React SPA, mounting the app into a `#root` div and loading the TypeScript entry point via a module script.",
  "frontend/src/App.tsx": "Root application component that configures TanStack Router with all page routes, wraps protected routes with `ProtectedRoute`, and provides theme, toast, and user profile setup globally.",
  "frontend/src/components/AdminGuard.tsx": "Authorization guard component that restricts access to admin pages by verifying the authenticated user's profile email matches the hardcoded admin email (`finproledge@gmail.com`), showing appropriate loading, login, or access-denied states otherwise.",
  "frontend/src/components/AdminPaymentSettings.tsx": "Admin-only form component for configuring the PayPal receiving email address, with validation, success/error alerts, and loading skeleton state.",
  "frontend/src/components/AdminPaymentTable.tsx": "Displays all client payment records in a table with status badges, payment method labels, and a dropdown to update payment status; also shows a banner for the configured PayPal receiving account.",
  "frontend/src/components/DeliverableCard.tsx": "Card component that displays a compliance deliverable's title, type, due date, status badge, days remaining, and a warning highlight when the deadline is within 5 days.",
  "frontend/src/components/DocumentTable.tsx": "Renders a table of client documents with their type, upload date, and a download button that opens the file's direct URL in a new tab.",
  "frontend/src/components/Layout.tsx": "Top-level page layout wrapping children with a sticky Navigation header and a footer containing firm info, services, contact details, and a caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing a spinner during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar with logo, role-based visible links (public, authenticated, admin-only), user display name, login button, and a mobile hamburger menu.",
  "frontend/src/components/PaymentForm.tsx": "A React form component for submitting payments, supporting multiple currencies, payment methods, and card types, with validation and success/error feedback.",
  "frontend/src/components/PaymentHistoryTable.tsx": "Displays a paginated table of the current user's payment history with status badges, formatted amounts, and loading skeletons.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated users to a login prompt and shows a loading spinner while the identity is initializing.",
  "frontend/src/components/ServiceRequestForm.tsx": "A form for submitting accounting/tax service requests with service type selection, description textarea, and a date picker for deadlines.",
  "frontend/src/components/UserProfileSetup.tsx": "A modal dialog that prompts newly authenticated users to complete their profile (name, email, company) before using the app.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useApprovals.ts": "Provides React Query hooks for listing approvals, setting approval status, checking if the caller is approved, and requesting approval via the backend actor.",
  "frontend/src/hooks/useDeliverables.ts": "Provides React Query hooks for fetching the caller's deliverables, all deliverables, pending deliverables, and updating deliverable status.",
  "frontend/src/hooks/useDocuments.ts": "Provides React Query hooks for fetching all client documents and uploading new documents to the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/usePayments.ts": "Exports React Query hooks for payment operations including fetching user/all payments, creating payments, updating payment status, and managing admin payment settings via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty placeholder file that re-exports nothing, noting that feature-specific hooks are used instead.",
  "frontend/src/hooks/useServiceRequests.ts": "Exports React Query hooks for service request CRUD operations including fetching user/all requests, creating standard and visitor requests, and updating request status via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Exports React Query hooks for fetching the caller's profile, fetching a specific user's profile by Principal, and saving the caller's user profile via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Lora and IBM Plex Sans fonts, configures Tailwind CSS, and defines CSS custom properties for a deep navy/gold design system with light and dark mode themes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the root DOM element.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabbed views for managing service requests, documents, client approvals, and payment settings, protected by an AdminGuard component.",
  "frontend/src/pages/ClientPortalPage.tsx": "Client portal page allowing authenticated users to view their service requests, upload documents, request account approval, and manage payments via tabbed sections.",
  "frontend/src/pages/ComplianceDashboardPage.tsx": "Displays a compliance dashboard showing summary stats (total, pending, completed deliverables) and lists pending/all deliverables with due-soon alerts using data from custom hooks.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page for FINPROLEDGE featuring a hero section, services overview, stats, and core principles with links to service booking and the client portal.",
  "frontend/src/pages/ServiceBookingPage.tsx": "Authenticated service booking page that renders a ServiceRequestForm alongside a sidebar explaining the review/consultation/execution process and a guarantee card.",
  "frontend/src/pages/VisitorServiceRequestPage.tsx": "Public-facing service request form for unauthenticated visitors to submit their name, email, company, service type, description, and deadline, with a success confirmation state after submission.",
  "frontend/src/utils/dateHelpers.ts": "Utility functions for working with nanosecond-precision timestamps: calculates days remaining, formats a deadline date, and checks if a deadline is within 5 days.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with CSS-variable-based colors, Lora/IBM Plex Sans fonts, custom shadows, border radii, and enabling the animate and typography plugins.",
  "project_state.json": "Tracks the FINPROLEDGE project state including existing features (multi-currency card payments, PayPal admin settings, payment table display) and pending feature requests (backend Payment type updates for currency/card storage). Defines architectural notes around the client-card-to-admin-PayPal payment flow."
}