{
  "backend/main.mo": "Main ICP actor defining all backend types (ServiceRequest, ClientDocument, ComplianceDeliverable, PaymentRecord, etc.) and including authorization and blob-storage mixins with migration support.",
  "backend/migration.mo": "Identity migration module that passes old actor state through unchanged, used for canister upgrades with no breaking state changes.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs (bug fixes and enhancements for admin tabs, principal display, table sorting/filtering) to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's purpose, used as a build-planning reference for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the FINPROLEDGE React SPA, mounting the app at #root and loading the main TSX entry point.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with all page routes (including protected admin/compliance-admin routes), QueryClient, ThemeProvider, and Toaster.",
  "frontend/src/components/AdminClientDeliverableTable.tsx": "Admin table component for client deliverables with sortable/filterable columns, per-row client profile resolution (name, company, principal), status badges, accept/reject actions, and an admin upload dialog.",
  "frontend/src/components/AdminGuard.tsx": "A route guard component that restricts access to admin-only content by verifying Internet Identity authentication, backend admin status, and a specific hardcoded admin email before rendering children.",
  "frontend/src/components/AdminPaymentSettings.tsx": "A form component for admins to configure and save the PayPal receiving email address for client payments, with validation and success/error feedback.",
  "frontend/src/components/AdminPaymentTable.tsx": "Displays a table of all client payment records with status badges and a dropdown to update payment status, also showing the configured PayPal receiving account.",
  "frontend/src/components/analytics/ClientRetentionSection.tsx": "Displays a client retention analytics section with a pie chart comparing returning vs. new visitors and a funnel table showing portal drop-off rates at each step.",
  "frontend/src/components/analytics/ConversionAnalysisSection.tsx": "Renders a conversion and goal analysis section showing an overall conversion rate card and a breakdown table of individual goal completions (forms, sign-ups, uploads).",
  "frontend/src/components/analytics/LeadGenerationSection.tsx": "Displays lead generation metrics including form submission rates, click-to-call counts, and a lead quality breakdown (high/medium/low) with progress bars and a categorized table.",
  "frontend/src/components/analytics/SearchIntentSection.tsx": "Displays a search intent and SEO section showing local SEO keyword rankings, seasonal traffic bar chart, and AI search visibility score using data from SearchIntentMetrics.",
  "frontend/src/components/analytics/SEOAnalysisSection.tsx": "Renders an SEO analysis dashboard section with stat cards for SEO score, click-through rate, and backlink health, plus a keyword rankings table with position deltas and a domain authority card.",
  "frontend/src/components/analytics/TechnicalPerformanceSection.tsx": "Shows Core Web Vitals (LCP, INP, CLS) as scored cards with ratings, a mobile-friendliness score, and an error monitoring table listing 404s and broken links.",
  "frontend/src/components/analytics/TechnicalReliabilitySection.tsx": "Renders a technical reliability section with three cards covering SSL/security score, mobile responsiveness score, and page load speed, derived from TechnicalReliabilityMetrics.",
  "frontend/src/components/analytics/TrafficAcquisitionSection.tsx": "Displays traffic acquisition analytics including a bar chart of visits and conversions by source/medium, a pie chart of new vs. returning visitors, and a top landing pages table.",
  "frontend/src/components/analytics/TrustMetricsSection.tsx": "React component that displays trust and authority metrics for a financial services site, including average time on About/Team pages, review/testimonial clicks, and a table of blog article engagement stats.",
  "frontend/src/components/analytics/UserBehaviorSection.tsx": "React component that renders user behavior and engagement analytics, showing session duration, bounce rate, page views, scroll depth zones, and an event tracking table.",
  "frontend/src/components/AnalyticsDashboard.tsx": "A tabbed analytics dashboard that fetches and displays site metrics (traffic, SEO, conversions, etc.) across multiple sections, falling back to mock data when the backend returns null.",
  "frontend/src/components/ClientCreateDeadlineForm.tsx": "An empty file with no content.",
  "frontend/src/components/ClientCreateFollowUpForm.tsx": "A form component that allows clients to create follow-up items with a title, description, due date, status, and notes, submitting via the useCreateClientFollowUp hook.",
  "frontend/src/components/ClientCreateTimelineForm.tsx": "A form component for clients to create timeline entries with a title, description, start/end dates, and status, submitting via the useCreateClientTimeline hook with date validation.",
  "frontend/src/components/ClientCreateToDoForm.tsx": "A form component for clients to create new To-Do items with title, description, priority, status, and optional file attachment fields, using the useCreateClientToDo mutation hook.",
  "frontend/src/components/ClientDeliverableForm.tsx": "A form component that allows clients to submit deliverables by uploading a file with a title and description, showing upload progress and success/error feedback via toasts.",
  "frontend/src/components/ClientDeliverableTable.tsx": "A table component that displays a client's submitted deliverables with status badges and approve/reject action buttons, fetching data via useGetMyClientDeliverables.",
  "frontend/src/components/ClientTasksTab.tsx": "A tabbed interface component displaying a client's To-Dos, Timelines, and Follow-Ups in separate tables, with dialogs to create new items for each category.",
  "frontend/src/components/ComplianceAdminDeadlineCountdown.tsx": "An empty file with no content or implementation.",
  "frontend/src/components/ComplianceAdminFollowUp.tsx": "A compliance admin table component that lists all client follow-up items with client name resolution, due dates, and inline status update selects.",
  "frontend/src/components/ComplianceAdminTimeline.tsx": "A compliance admin table component that displays all client timeline entries with status badges, client name resolution, date ranges, and inline status update selects.",
  "frontend/src/components/ComplianceAdminToDoList.tsx": "Renders a table of all admin to-do items with priority badges, client name resolution, status selectors, and a download options menu for exporting table data and attached documents.",
  "frontend/src/components/ComplianceDocumentList.tsx": "Displays a card listing the current user's completed and approved compliance deliverables with type labels, status badges, and a download button for each document.",
  "frontend/src/components/CreateDeadlineForm.tsx": "Empty file with no content; likely a placeholder for a deadline creation form component.",
  "frontend/src/components/CreateFollowUpForm.tsx": "Form component for creating a follow-up item with fields for title, description, due date, status, notes, and an optional client assignment from approved users.",
  "frontend/src/components/CreateTimelineForm.tsx": "Form component for creating a timeline entry with title, description, start/end dates, status, and optional client principal, submitting via the useCreateTimelineEntry mutation.",
  "frontend/src/components/CreateToDoForm.tsx": "Form component for creating a to-do item with title, description, priority, status, optional client assignment, and an optional file attachment that is encoded as an ExternalBlob before submission.",
  "frontend/src/components/DeliverableCard.tsx": "Renders a compliance deliverable card with status/type badges, due date urgency indicators, and approve/reject action buttons (currently stubbed pending backend support).",
  "frontend/src/components/DocumentTable.tsx": "Displays a table of client documents with type badges, upload dates, and per-row download buttons, plus an optional admin bulk-export menu via DownloadOptionsMenu.",
  "frontend/src/components/DocumentUploadForm.tsx": "Provides a drag-and-drop file upload form with document type selection that reads the file as binary and submits it via the useUploadDocument mutation hook.",
  "frontend/src/components/DownloadOptionsMenu.tsx": "A dropdown menu component that offers multiple export formats (PDF, XLSX, DOCX, CSV, ZIP, image) for table data or file blobs, delegating to utility export functions.",
  "frontend/src/components/EcwidWidget.tsx": "Empty file with no content.",
  "frontend/src/components/Layout.tsx": "Main page layout wrapper that renders the Navigation header, a flexible main content area, and a multi-column footer with service links, quick links, and contact details.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading state during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/MyComplianceTasksSection.tsx": "Displays a tabbed dashboard of the current user's compliance tasks (To-Dos, Timelines, Follow-Ups) with summary stats, status selectors, and dialogs for creating new items.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with links to Home, a services dropdown, and conditional admin/dashboard links based on authentication state and user email.",
  "frontend/src/components/PaymentForm.tsx": "Form component for submitting a new payment request, supporting multiple currencies, payment methods, and card types with validation and success/error feedback.",
  "frontend/src/components/PaymentHistoryTable.tsx": "Displays a paginated table of the authenticated user's past payments with amount, method, status badge, and date, including loading skeletons and an empty state.",
  "frontend/src/components/ProtectedRoute.tsx": "Wraps child routes to require Internet Identity authentication, showing a loading spinner during initialization and a login prompt if unauthenticated.",
  "frontend/src/components/ServiceRequestForm.tsx": "Form for submitting a new client service request, allowing selection of service type, description, and deadline, with toast notifications on success or failure.",
  "frontend/src/components/TaskStatusSelect.tsx": "Exports three dropdown select components (ToDoStatusSelect, TimelineStatusSelect, FollowUpStatusSelect) that allow inline status updates for compliance tasks with optimistic UI updates and toast notifications.",
  "frontend/src/components/UserProfileSetup.tsx": "Renders a modal dialog that prompts newly authenticated users to complete their profile (name, email, company) and saves it via the useSaveCallerUserProfile hook.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an Internet Computer actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAnalytics.ts": "Custom hooks that fetch analytics data from the backend actor via React Query, exposing both a legacy analytics summary and a new analytics summary covering lead generation, trust, search intent, technical reliability, and client retention metrics.",
  "frontend/src/hooks/useApprovals.ts": "Custom hooks for managing user approval workflows, providing queries to list approvals and check caller approval status, and mutations to set approval or request approval.",
  "frontend/src/hooks/useClientDeliverables.ts": "Custom hooks for client deliverable operations, including fetching personal and all deliverables, submitting deliverables (with optional upload progress), submitting on behalf of a client, and updating deliverable status.",
  "frontend/src/hooks/useComplianceAdmin.ts": "Custom hooks for compliance administration, providing queries and mutations for managing to-dos, timelines, and follow-ups for both admin and client contexts.",
  "frontend/src/hooks/useDeliverables.ts": "Custom hooks for compliance deliverables, exposing queries to fetch personal, pending, and all deliverables, plus a mutation to create a new deliverable assigned to a client.",
  "frontend/src/hooks/useDocuments.ts": "Custom hooks for document management, providing a query to fetch all client documents and a mutation to upload a new document with type, name, MIME type, and file blob.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state and persisting identity via AuthClient.",
  "frontend/src/hooks/usePayments.ts": "Custom React Query hooks for payment operations including fetching user/admin payments, creating payments, updating payment status, and managing admin payment settings.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file that re-exports nothing, noting that feature-specific hooks are used instead.",
  "frontend/src/hooks/useServiceRequests.ts": "Custom React Query hooks for service request CRUD operations including fetching, creating, and updating status of service requests via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Custom React Query hooks for fetching and saving user profiles, including lookup by principal string.",
  "frontend/src/index.css": "Global CSS file defining a dark-themed design system with OKLCH color tokens, Tailwind directives, and typography using Lora and IBM Plex Sans fonts.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutUsPage.tsx": "Static marketing page describing the company's mission, core competencies, and services with a hero section and feature cards.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabbed interface covering service requests, documents, deliverables, payments, approvals, compliance tools, and analytics, protected by AdminGuard.",
  "frontend/src/pages/ClientPortalPage.tsx": "Client portal page with tabbed navigation for managing service requests, documents (upload/view), payments, and deliverables, filtered to the authenticated user's principal.",
  "frontend/src/pages/ComplianceAdminDashboardPage.tsx": "Admin-only compliance dashboard with tabs for To-Do List, Timeline, and Follow-Up sections, each with a dialog-based creation form guarded by AdminGuard.",
  "frontend/src/pages/ComplianceDashboardPage.tsx": "Authenticated user compliance dashboard with tabs for compliance tasks, deliverables, task deadlines, and documents; redirects unauthenticated users.",
  "frontend/src/pages/HomePage.tsx": "Public marketing homepage showcasing the firm's financial services (tax, audit, payroll, etc.) with service cards, feature highlights, and links to service booking.",
  "frontend/src/pages/ServiceBookingPage.tsx": "Service booking page that renders the ServiceRequestForm alongside a sidebar explaining the review, consultation, and execution workflow and the firm's guarantee.",
  "frontend/src/pages/VisitorServiceRequestPage.tsx": "Public contact/service request page for unauthenticated visitors to submit inquiries with name, email, service type, and description, showing a success screen on submission.",
  "frontend/src/utils/dateHelpers.ts": "Utility functions for working with nanosecond-precision timestamps: calculating days remaining, formatting deadlines, and checking if a deadline is within 5 days.",
  "frontend/src/utils/fileExport.ts": "Provides browser-native client-side export utilities to download table data as CSV, XLSX (SpreadsheetML XML), or Word-compatible HTML documents using Blob and anchor-click triggering.",
  "frontend/src/utils/tableHelpers.ts": "Provides generic client-side table utilities including sorting by column/direction, multi-field filtering, and toggling sort direction state.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL query parameters from both regular and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with CSS-variable-based color tokens, custom fonts (Lora, IBM Plex Sans), border radii, box shadows, and enabling the animate and typography plugins.",
  "project_state.json": "Tracks project state including existing features, known issues, and pending feature requests such as fixing Admin Tab save errors, displaying client company/registered names alongside Principal IDs, and adding sort/filter to the deliverables table."
}