{
  "backend/main.mo": "Main Motoko actor for the FINPROLEDGE backend, defining data types (ServiceRequest, ClientDocument, ComplianceDeliverable, PaymentRecord, etc.) and mixing in authorization and blob-storage functionality for a financial services platform.",
  "feature_evidence.json": "Feature evidence report mapping two admin-access features (AdminGuard email-based override and Navigation admin link visibility for finproledge@gmail.com) to their implementing files and component dependencies.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary catalogue describing the purpose and key changes of each frontend source file across pages, components, and hooks.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, chart palette, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell titled 'FINPROLEDGE' that mounts the React app via a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application component that configures TanStack Router with all page routes (including protected and admin routes), wraps the app in QueryClient and ThemeProvider, and renders the router.",
  "frontend/src/components/AdminClientDeliverableTable.tsx": "Admin table component for viewing, approving/rejecting, and submitting client deliverables, with a dialog form for adding new deliverables on behalf of a client principal and a bulk download options menu.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that grants admin access if the backend confirms admin role or if the authenticated user's email (from profile or localStorage) matches the hardcoded admin email list (finproledge@gmail.com), showing appropriate loading and access-denied states otherwise.",
  "frontend/src/components/AdminPaymentSettings.tsx": "Admin-only form component for configuring the PayPal receiving email address, with validation, success/error alerts, and persistence via a mutation hook.",
  "frontend/src/components/AdminPaymentTable.tsx": "Displays a table of all client payment records with status badges, payment method labels, and an inline status-update selector, plus a banner showing the configured PayPal account.",
  "frontend/src/components/analytics/ClientRetentionSection.tsx": "Displays client retention analytics including a pie chart of returning vs. new visitors and a portal funnel drop-off table, derived from ClientRetentionMetrics data.",
  "frontend/src/components/analytics/ConversionAnalysisSection.tsx": "Renders a conversion and goal analysis section showing an overall conversion rate card and a breakdown table of individual goal completions (forms, sign-ups, uploads) with computed rates.",
  "frontend/src/components/analytics/LeadGenerationSection.tsx": "Displays lead generation metrics including form submission counts, click-to-call actions, and a lead quality breakdown table categorized by high, medium, and low value leads.",
  "frontend/src/components/analytics/SearchIntentSection.tsx": "React component showing local SEO keyword rankings, seasonal traffic trends via a bar chart, and AI search engine visibility score using SearchIntentMetrics data.",
  "frontend/src/components/analytics/SEOAnalysisSection.tsx": "React component that displays an SEO analysis dashboard with stat cards for SEO score, click-through rate, and backlink health, plus a keyword rankings table with position deltas.",
  "frontend/src/components/analytics/TechnicalPerformanceSection.tsx": "React component displaying Core Web Vitals (LCP, INP, CLS) with ratings, mobile-friendliness score, and an error monitoring table for 404s and broken links.",
  "frontend/src/components/analytics/TechnicalReliabilitySection.tsx": "React component that renders three metric cards for SSL/security status, mobile responsiveness score, and page load speed using TechnicalReliabilityMetrics data.",
  "frontend/src/components/analytics/TrafficAcquisitionSection.tsx": "React component visualizing website traffic acquisition with a bar chart of visits and conversions by source/medium, a pie chart of new vs. returning visitors, and a top landing pages table.",
  "frontend/src/components/analytics/TrustMetricsSection.tsx": "React component that displays trust and authority metrics for a financial services site, including average time on About/Team pages, review/testimonial clicks, and a blog article engagement table with static mock data.",
  "frontend/src/components/analytics/UserBehaviorSection.tsx": "React component that renders user behavior and engagement metrics (average session duration, bounce rate, page views, sessions) alongside scroll depth zones and event tracking data, using a mix of live props and static mock data.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Tabbed analytics dashboard that fetches site analytics data (falling back to mock data) and renders sections for traffic, user behavior, SEO, performance, conversions, lead generation, trust metrics, search intent, technical reliability, and client retention.",
  "frontend/src/components/ClientCreateDeadlineForm.tsx": "Empty file with no content.",
  "frontend/src/components/ClientCreateFollowUpForm.tsx": "Form component that allows clients to create a follow-up item with title, description, due date, status, and notes, submitting via the useCreateClientFollowUp mutation hook.",
  "frontend/src/components/ClientCreateTimelineForm.tsx": "Form component for creating a client timeline entry with title, description, start/end dates, and status, with date validation and submission via the useCreateClientTimeline mutation hook.",
  "frontend/src/components/ClientCreateToDoForm.tsx": "A form component for clients to create new To-Do items with title, description, priority, status, and optional file attachment fields, using the useCreateClientToDo mutation hook.",
  "frontend/src/components/ClientDeliverableForm.tsx": "A form component that allows clients to submit deliverables by uploading a file with a title and description, showing upload progress and success/error feedback via toasts.",
  "frontend/src/components/ClientDeliverableTable.tsx": "A table component that displays a client's submitted deliverables with their status badges and allows admins to approve or reject each deliverable.",
  "frontend/src/components/ClientTasksTab.tsx": "A tabbed interface component displaying a client's To-Dos, Timelines, and Follow-Ups in separate tables, with dialogs to create new items for each category.",
  "frontend/src/components/ComplianceAdminDeadlineCountdown.tsx": "An empty file with no content.",
  "frontend/src/components/ComplianceAdminFollowUp.tsx": "A table component for compliance admins to view all follow-up items, displaying client names (resolved from principals), due dates, notes, and an inline status selector.",
  "frontend/src/components/ComplianceAdminTimeline.tsx": "Admin table component that displays all timeline entries with title, assigned client (resolved via principal lookup), date range, and an inline status selector. Handles loading skeletons and empty/error states.",
  "frontend/src/components/ComplianceAdminToDoList.tsx": "Admin to-do list table that shows all to-do items with priority/status badges, client name resolution, document download support, and export options; includes a dialog for creating new to-dos.",
  "frontend/src/components/ComplianceDocumentList.tsx": "Client-facing card component that lists the current user's completed and approved deliverable documents with type labels, dates, status badges, and download buttons.",
  "frontend/src/components/CreateDeadlineForm.tsx": "Empty file with no content; likely a placeholder for a deadline creation form component.",
  "frontend/src/components/CreateFollowUpForm.tsx": "Form component for admins to create a new follow-up item, collecting title, description, due date, status, notes, and an optional client principal selected from approved clients.",
  "frontend/src/components/CreateTimelineForm.tsx": "Form component for admins to create a new timeline entry with title, description, start/end dates, status, and an optional client principal selected from approved clients.",
  "frontend/src/components/CreateToDoForm.tsx": "A form component for creating To-Do items with fields for title, description, priority, status, assigned client, and optional file attachment, using React Query mutations and toast notifications.",
  "frontend/src/components/DeliverableCard.tsx": "A card component that displays a compliance deliverable's details including status, type, due date, and urgency indicators, with placeholder approve/reject mutation buttons that currently return errors.",
  "frontend/src/components/DocumentTable.tsx": "A table component that lists client documents with type badges, upload dates, and download functionality, supporting both admin mode (prop-supplied documents) and client mode (fetched documents) with export options.",
  "frontend/src/components/DocumentUploadForm.tsx": "A form component for uploading client documents with document type selection, drag-and-drop file input, upload progress tracking, and approval status handling.",
  "frontend/src/components/DownloadOptionsMenu.tsx": "A dropdown menu component offering multiple export formats (PDF, XLSX, DOCX, CSV, ZIP, image) for table data and file blobs, with per-format loading state management.",
  "frontend/src/components/EcwidWidget.tsx": "An empty file with no content.",
  "frontend/src/components/Layout.tsx": "Defines the main page layout wrapper with a sticky Navigation, main content area, and a footer containing brand info, social links, and quick navigation links.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, showing loading, logged-in, or logged-out states and clearing the React Query cache on logout.",
  "frontend/src/components/MyComplianceTasksSection.tsx": "Displays a tabbed compliance dashboard for the current user showing To-Dos, Timelines, and Follow-Ups with summary stats, status selectors, and dialogs to create new items.",
  "frontend/src/components/Navigation.tsx": "Renders the sticky top navigation bar with a services dropdown, authentication-aware links, admin badge detection via backend and email checks, and a responsive mobile menu.",
  "frontend/src/components/PaymentForm.tsx": "Provides a payment submission form supporting multiple currencies, payment methods, and card types, submitting via the useCreatePayment hook and displaying success or error feedback.",
  "frontend/src/components/PaymentHistoryTable.tsx": "Fetches and displays the current user's payment history in a table with formatted amounts, dates, status badges, and payment method labels, including loading skeletons and an empty state.",
  "frontend/src/components/ProtectedRoute.tsx": "Guards child routes by checking Internet Identity authentication status, showing a spinner during initialization and a login prompt with navigation options when unauthenticated.",
  "frontend/src/components/ServiceRequestForm.tsx": "A form component that allows authenticated users to submit service requests by selecting a service type, entering a description, and choosing a deadline. Uses the useCreateRequest hook to persist data and shows toast notifications on success or failure.",
  "frontend/src/components/TaskStatusSelect.tsx": "Provides three optimistic-update select components (ToDoStatusSelect, TimelineStatusSelect, FollowUpStatusSelect) for updating the status of compliance tasks inline, with loading indicators and toast feedback.",
  "frontend/src/components/UserProfileSetup.tsx": "A modal dialog that appears after login when no user profile exists, prompting the user to enter their name, email, and company to complete initial profile setup via the useSaveCallerUserProfile hook.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an Internet Computer actor (authenticated or anonymous) using React Query, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAnalytics.ts": "Custom React hooks that fetch analytics data from the backend actor via React Query, exposing both a legacy `getAnalyticsSummary` and a newer `getNewAnalyticsSummary` endpoint with typed return shapes.",
  "frontend/src/hooks/useApprovals.ts": "Custom React hooks for managing user approval workflows, providing queries to list approvals and check caller approval status, plus mutations to set approval and request approval.",
  "frontend/src/hooks/useClientDeliverables.ts": "Custom React hooks for client deliverable CRUD operations, including fetching own and all deliverables, submitting deliverables (with optional upload progress), and updating deliverable status.",
  "frontend/src/hooks/useComplianceAdmin.ts": "Custom React hooks for compliance administration, providing queries and mutations for managing to-dos, timelines, and follow-ups for both admin (all records) and client (own records) views.",
  "frontend/src/hooks/useDeliverables.ts": "Custom React hooks for compliance deliverables, exposing queries to fetch a user's own, pending, and all deliverables, plus a mutation to create a new deliverable assigned to a client.",
  "frontend/src/hooks/useDocuments.ts": "Custom React hooks for document management, providing a query to fetch all client documents and a mutation to upload a new document with type, name, MIME type, and file blob.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, AuthClient creation, and identity persistence across page reloads.",
  "frontend/src/hooks/usePayments.ts": "Custom React Query hooks for payment operations including fetching user/all payments, creating payments, updating payment status, and managing admin payment settings.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file that re-exports nothing, noting that feature-specific hooks are used instead.",
  "frontend/src/hooks/useServiceRequests.ts": "Custom React Query hooks for service request CRUD operations including fetching, creating, and updating the status of service requests for both users and admins.",
  "frontend/src/hooks/useUserProfile.ts": "Custom React Query hooks for fetching and saving user profiles by caller identity or principal, with error handling for unapproved/anonymous users.",
  "frontend/src/index.css": "Global stylesheet defining a dark-themed design system with CSS custom properties for colors (navy/gold palette), Tailwind directives, and typography using Lora and IBM Plex Sans fonts.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutUsPage.tsx": "Static marketing page describing the company's mission and core competencies (taxation, audit, accounting, financial administration) with a hero section and feature cards.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabbed sections for managing service requests, documents, user approvals, payments, deliverables, and analytics, protected by an AdminGuard component.",
  "frontend/src/pages/ClientPortalPage.tsx": "Client portal page with tabbed navigation for service requests, document upload/viewing, payments, and deliverables, filtered to the authenticated user's data.",
  "frontend/src/pages/ComplianceAdminDashboardPage.tsx": "Admin dashboard page for managing compliance To-Dos, Timelines, and Follow-Ups, with dialog-based creation forms for each category.",
  "frontend/src/pages/ComplianceDashboardPage.tsx": "Compliance dashboard for authenticated users with tabs for compliance tasks, deliverables, task deadlines, and documents.",
  "frontend/src/pages/HomePage.tsx": "Public marketing homepage displaying services, company principles, testimonials, and stats for the FinProLedge accounting firm.",
  "frontend/src/pages/ServiceBookingPage.tsx": "Public service booking page that renders the ServiceRequestForm alongside a sidebar explaining the review, consultation, and execution process.",
  "frontend/src/pages/VisitorServiceRequestPage.tsx": "Public contact/enquiry page allowing unauthenticated visitors to submit a service request with their name, email, company, and service type.",
  "frontend/src/utils/dateHelpers.ts": "Utility functions for converting nanosecond timestamps to days remaining, formatted date strings, and checking if a deadline is within five days.",
  "frontend/src/utils/fileExport.ts": "Provides browser-native utilities to export table data as CSV, XLSX (SpreadsheetML XML), or Word-compatible HTML documents by triggering a Blob download. No external dependencies are used.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that enables dark mode, maps CSS variable-based design tokens (colors, radius, shadows), sets Lora/IBM Plex Sans font families, and registers the animate and typography plugins.",
  "project_state.json": "Tracks the FINPROLEDGE Portal project state including completed features (admin access fixes for finproledge@gmail.com in AdminGuard and Navigation) and one pending request to audit backend role-check logic for the same user."
}