{
  "kind": "build_request",
  "title": "Fix admin portal access for finproledge@gmail.com",
  "projectName": "FinProLedge Portal",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure that the user with email finproledge@gmail.com is granted admin access to the admin portal. The AdminGuard component must correctly recognize this email as an authorized admin, and the backend role check must return an admin role for this user. All three layers — AdminGuard email-based override, Navigation admin tab visibility, and backend role fallback — must allow this user through without error.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "can you give it a try and let me know if finproledge@gmail.com can access it now before we push to production? still no"
        ]
      },
      "acceptanceCriteria": [
        "User with email finproledge@gmail.com can log in via Internet Identity and successfully reach the Admin Dashboard page without being shown an access-denied or login prompt screen.",
        "The Navigation component displays the admin tab/link when finproledge@gmail.com is authenticated.",
        "AdminGuard allows finproledge@gmail.com through on the email-based override check.",
        "The backend returns an admin role (or equivalent authorization) for the principal associated with finproledge@gmail.com.",
        "No regression: other non-admin users are still denied access to admin-only pages."
      ]
    }
  ],
  "constraints": [
    "Do not alter immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "All Motoko logic must remain in the single backend/main.mo actor.",
    "Only generate migration.mo if existing persisted state must be upgraded."
  ],
  "nonGoals": [
    "Adding new admin users beyond finproledge@gmail.com.",
    "Changing the general authentication flow or Internet Identity integration.",
    "UI redesign or visual changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}