{
  "kind": "build_request",
  "title": "Admin file downloads in multiple formats + remove outdated stat copy",
  "projectName": "FINPROLEDGE Portal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a download options menu in the Admin Dashboard that allows admins to download files (documents, deliverables, to-do attachments) in the following formats: PDF, spreadsheet (XLSX/CSV), document (DOCX), CSV, ZIP folder, or image (PNG/JPG). The download button should present a dropdown with these format options. For formats that require conversion (e.g., exporting a list as CSV or ZIP), generate the file client-side from available data. For file blobs already stored (e.g., uploaded documents and deliverables), provide direct download with the selected format extension. ZIP downloads should bundle multiple selected files into a single archive.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Admins can download files as PDFs, spreadsheets, documents, CSVs, ZIP folders, or images."
        ]
      },
      "acceptanceCriteria": [
        "Admin users see a download dropdown with options: PDF, Spreadsheet, Document, CSV, ZIP, Image on relevant tables (DocumentTable, AdminClientDeliverableTable, ComplianceAdminToDoList).",
        "Selecting CSV exports the visible table data as a .csv file download.",
        "Selecting ZIP bundles available file blobs into a downloadable .zip archive.",
        "Selecting PDF triggers a print-to-PDF or generates a PDF from the table/document data.",
        "Selecting Image downloads the file as a .png or .jpg where applicable.",
        "Selecting Spreadsheet downloads data as a .xlsx or .csv file.",
        "Selecting Document downloads the file as a .docx where applicable.",
        "Download functionality is only accessible to authenticated admin users (AdminGuard protected).",
        "Non-admin users do not see the download format options."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the '99.8% filling accuracy' statistic and the 'client support 24/7' text from all locations in the frontend UI where they currently appear (likely on the HomePage stats/marketing section).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Remove the 99.8% filling accuracy and client support 24/7."
        ]
      },
      "acceptanceCriteria": [
        "The text '99.8% filling accuracy' (or similar variant) does not appear anywhere in the rendered UI.",
        "The text 'client support 24/7' (or similar variant such as '24/7 support') does not appear anywhere in the rendered UI.",
        "Removing these items does not break the layout of the section they were in; remaining stat cards or items are laid out cleanly."
      ]
    }
  ],
  "constraints": [
    "Admin download functionality must respect the AdminGuard — only authenticated admins may access it.",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "File downloads must be generated client-side; do not add new backend endpoints solely for format conversion.",
    "All backend Motoko logic must remain in backend/main.mo (single-actor architecture)."
  ],
  "nonGoals": [
    "Server-side file format conversion or new backend download endpoints.",
    "Adding download capabilities to non-admin (client) views.",
    "Changing any other marketing copy beyond the two specified stat items.",
    "Implementing real-time file processing or external conversion APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}