{
  "kind": "build_request",
  "title": "Fix admin portal access for finproledge@gmail.com",
  "projectName": "FINPROLEDGE Portal",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure that a user authenticated with the email finproledge@gmail.com is reliably granted admin access in the AdminGuard component, bypassing or correctly resolving the backend role check so the admin portal renders without being blocked or redirected.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "can you check if finproledge@gmail.com can access the admin portal this time before we push to production?"
        ]
      },
      "acceptanceCriteria": [
        "A user whose verified email is finproledge@gmail.com can navigate to the admin portal without being shown a 'not authorized' or login-prompt screen.",
        "AdminGuard correctly identifies finproledge@gmail.com as an admin during the email-verification fallback path.",
        "The admin portal tabs (service requests, documents, approvals, payments, deliverables, analytics) are all visible and functional for finproledge@gmail.com.",
        "No regression: users without admin privileges are still blocked by AdminGuard."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Navigation component also surfaces admin-only links (e.g., Admin Dashboard) when the authenticated user's email is finproledge@gmail.com, consistent with the AdminGuard fix.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "can you check if finproledge@gmail.com can access the admin portal this time"
        ]
      },
      "acceptanceCriteria": [
        "Admin navigation links are visible in the top nav bar when logged in as finproledge@gmail.com.",
        "Admin navigation links remain hidden for non-admin users."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Audit and fix the backend role-check logic so that the principal associated with finproledge@gmail.com is recognised as an admin by the isAdmin (or equivalent) backend function, ensuring AdminGuard's backend query path also succeeds for this user.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "can you check if finproledge@gmail.com can access the admin portal this time before we push to production?"
        ]
      },
      "acceptanceCriteria": [
        "The backend returns true for isAdmin (or equivalent) when called by the principal linked to finproledge@gmail.com.",
        "The fix does not grant admin rights to any other unintended principal.",
        "Existing admin principals continue to be recognised correctly."
      ]
    }
  ],
  "constraints": [
    "Do not alter immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not remove or weaken access controls for non-admin users.",
    "Keep all Motoko logic within the single main actor file (backend/main.mo)."
  ],
  "nonGoals": [
    "Adding new admin features or dashboard tabs.",
    "Changing the authentication provider (Internet Identity remains the sole auth mechanism).",
    "Modifying any user-facing design or styling."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}