{
  "kind": "build_request",
  "title": "Restrict Admin Access to finproledge@gmail.com Only",
  "projectName": "FINPROLEDGE Portal",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the AdminGuard component to allow admin access exclusively to the email address finproledge@gmail.com. Any authenticated user whose profile email does not exactly match finproledge@gmail.com must be shown an 'Access Denied' state and prevented from viewing any admin-only pages or content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Provide Admin Access only to this Email finproledge@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "AdminGuard in frontend/src/components/AdminGuard.tsx only grants access when the authenticated user's email is exactly 'finproledge@gmail.com'.",
        "Any other authenticated user visiting an admin-protected route sees an 'Access Denied' message.",
        "Unauthenticated users are still redirected to log in before the email check occurs.",
        "The admin navigation links in Navigation.tsx are only visible to the user with email finproledge@gmail.com.",
        "The isCallerAdmin check used in Navigation.tsx and other components is consistent with the finproledge@gmail.com restriction."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the backend isCallerAdmin authorization logic recognizes only the principal associated with the Internet Identity linked to finproledge@gmail.com as an admin. All admin-gated backend methods must reject calls from any other principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Provide Admin Access only to this Email finproledge@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "The backend admin authorization mixin or actor exposes an isCallerAdmin query that returns true only for the designated admin principal.",
        "All admin-only update/query methods return an authorization error for non-admin callers.",
        "No other email or principal is granted admin privileges."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed under frontend.immutablePaths.",
    "The only permitted admin email is finproledge@gmail.com — no other emails or principals should receive admin access."
  ],
  "nonGoals": [
    "Adding support for multiple admin accounts or roles.",
    "Building an admin management UI to add/remove admins dynamically.",
    "Changing any non-admin-related functionality or UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}