{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update navigation hierarchy: nest Compliance under Client Portal and Compliance Admin under Admin menu",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Move the 'Compliance' link to appear as a nested item under the 'Client Portal' section in the Navigation component",
      "acceptanceCriteria": [
        "The 'Compliance' link is no longer rendered as a standalone top-level nav item.",
        "The 'Compliance' link appears grouped under or within the 'Client Portal' navigation section in both desktop and mobile menus.",
        "Clicking 'Compliance' still navigates to the compliance dashboard page.",
        "Visibility rules (authenticated + approved users only) are preserved."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Restructure the desktop navigation links to nest the 'Compliance' link under the 'Client Portal' section. Update the mobile menu to match. Ensure the link only appears for authenticated and approved users, and that clicking it navigates to /compliance-dashboard. Remove 'Compliance' from its current top-level position and group it within Client Portal's navigation structure."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Move the 'Compliance Admin' link to appear as a nested item under the 'Admin' menu section in the Navigation component",
      "acceptanceCriteria": [
        "The 'Compliance Admin' link is no longer rendered as a standalone top-level nav item.",
        "The 'Compliance Admin' link appears grouped under or within the 'Admin' navigation section in both desktop and mobile menus.",
        "Clicking 'Compliance Admin' still navigates to the compliance admin dashboard page.",
        "Visibility is restricted to admin users only (consistent with AdminGuard logic)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Restructure the desktop navigation links to nest the 'Compliance Admin' link under the 'Admin' menu section. Update the mobile menu to match. Ensure the link only appears for admin users (matching the existing AdminGuard logic), and that clicking it navigates to /compliance-admin-dashboard. Remove 'Compliance Admin' from its current top-level position and group it within the Admin navigation structure."
        }
      ]
    }
  ]
}