{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin portal access for finproledge@gmail.com",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure finproledge@gmail.com has full admin access through all three authorization layers (AdminGuard email override, Navigation admin tab visibility, backend role check)",
      "acceptanceCriteria": [
        "User with email finproledge@gmail.com can log in via Internet Identity and successfully reach the Admin Dashboard page without being shown an access-denied or login prompt screen.",
        "The Navigation component displays the admin tab/link when finproledge@gmail.com is authenticated.",
        "AdminGuard allows finproledge@gmail.com through on the email-based override check.",
        "The backend returns an admin role (or equivalent authorization) for the principal associated with finproledge@gmail.com.",
        "No regression: other non-admin users are still denied access to admin-only pages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminGuard.tsx",
          "operation": "modify",
          "description": "Update the email-based override check to correctly recognize finproledge@gmail.com as an authorized admin. Ensure the component checks the user's email from their profile (via useGetCallerUserProfile) and explicitly allows finproledge@gmail.com through before showing the access-denied screen. Verify the logic flow: (1) check authentication, (2) check email override for finproledge@gmail.com, (3) check backend admin role, (4) only show access-denied if all checks fail. Add console logging during development to debug which check is blocking the user."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Update the admin tab visibility logic to show the admin navigation link when the authenticated user's email is finproledge@gmail.com. Ensure the component fetches the user profile and checks both the backend admin role (via useQuery for isCallerAdmin) and the email-based override (finproledge@gmail.com) before rendering the admin menu item. The admin link should be visible if either condition is true."
        }
      ]
    }
  ]
}