{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restrict Admin Access to finproledge@gmail.com Only",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update AdminGuard component to restrict admin access exclusively to finproledge@gmail.com email address",
      "acceptanceCriteria": [
        "AdminGuard in frontend/src/components/AdminGuard.tsx only grants access when the authenticated user's email is exactly 'finproledge@gmail.com'.",
        "Any other authenticated user visiting an admin-protected route sees an 'Access Denied' message.",
        "Unauthenticated users are still redirected to log in before the email check occurs.",
        "The admin navigation links in Navigation.tsx are only visible to the user with email finproledge@gmail.com.",
        "The isCallerAdmin check used in Navigation.tsx and other components is consistent with the finproledge@gmail.com restriction."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminGuard.tsx",
          "operation": "modify",
          "description": "Update the AdminGuard component to check the authenticated user's profile email and only grant admin access when the email exactly matches 'finproledge@gmail.com'. Fetch the user profile via getCallerUserProfile() after authentication succeeds and before the isCallerAdmin check. Show appropriate loading states while fetching the profile. Display an 'Access Denied' message with clear explanation when the authenticated user's email does not match finproledge@gmail.com. Maintain existing behavior for unauthenticated users (redirect to login)."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Update the Navigation component to ensure admin navigation links (Admin Dashboard, Compliance Admin) are only displayed when both isCallerAdmin returns true AND the authenticated user's email is exactly 'finproledge@gmail.com'. Fetch the user profile using getCallerUserProfile() and verify the email matches before showing admin links. This ensures visual consistency with the AdminGuard access restriction."
        },
        {
          "path": "frontend/src/hooks/useUserProfile.ts",
          "operation": "modify",
          "description": "Ensure the useGetCallerUserProfile hook properly handles loading states and returns the user profile with email field. Verify the hook does not cache stale profile data across authentication sessions. This hook will be used by both AdminGuard and Navigation to check the email restriction."
        }
      ]
    }
  ]
}