{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add status change controls for client-facing task items",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add inline status-change controls in MyComplianceTasksSection for To-Dos, Timelines, Follow-Ups, and Deadlines so clients can update task statuses with immediate feedback",
      "acceptanceCriteria": [
        "Each task row in the My Compliance Tasks section (To-Dos, Timelines, Follow-Ups, Deadlines tabs) displays a status selector showing the current status.",
        "Selecting a new status triggers the correct backend mutation for that task type.",
        "A success toast is shown when the status is updated successfully.",
        "An error toast is shown if the update fails.",
        "The status badge/selector updates optimistically or refreshes after mutation completes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MyComplianceTasksSection.tsx",
          "operation": "modify",
          "description": "Add inline status select controls to each task type table (To-Dos, Timelines, Follow-Ups, Deadlines). For To-Dos, use a select dropdown that calls useUpdateClientToDoStatus with the task ID and new status. For Timelines, call useUpdateClientTimelineStatus. For Follow-Ups, call useUpdateClientFollowUpStatus. For Deadlines, call useUpdateClientDeadlineStatus. Each select should display the current status value and show a toast notification on mutation success or failure. Ensure the mutation hooks invalidate the appropriate query keys to refresh the task lists."
        },
        {
          "path": "frontend/src/hooks/useComplianceAdmin.ts",
          "operation": "modify",
          "description": "Add four new mutation hooks for client-facing status updates: useUpdateClientToDoStatus, useUpdateClientTimelineStatus, useUpdateClientFollowUpStatus, and useUpdateClientDeadlineStatus. Each hook should call the corresponding backend method (updateClientToDoStatus, updateClientTimelineStatus, updateClientFollowUpStatus, updateClientDeadlineStatus) and invalidate the query keys ['myToDos'], ['myTimelines'], ['myFollowUps'], ['myDeadlines'] respectively on success to refresh the UI data."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add inline status-change controls in ClientTasksTab for all four task types, reusing the status select logic from MyComplianceTasksSection for consistency",
      "acceptanceCriteria": [
        "Each task table in ClientTasksTab includes a status selector per row for all four task types.",
        "The status options match the valid statuses defined in the backend types for each task.",
        "Changing the status calls the correct mutation and shows feedback toasts.",
        "Newly created tasks show the status control immediately without requiring a page reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ClientTasksTab.tsx",
          "operation": "modify",
          "description": "Add inline status select controls to each task type table in the ClientTasksTab component. For the To-Dos table, add a select dropdown that uses useUpdateClientToDoStatus. For Timelines, use useUpdateClientTimelineStatus. For Follow-Ups, use useUpdateClientFollowUpStatus. For Deadlines, use useUpdateClientDeadlineStatus. Each select should mirror the implementation from MyComplianceTasksSection, showing the current status and calling the appropriate mutation hook on change. Display toast notifications for success and failure cases. Ensure the status options match the TypeScript enums: ToDoStatus (pending, inProgress, completed), TimelineStatus (planned, inProgress, completed), FollowUpStatus (pending, completed), DeadlineStatus (active, completed, missed)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure backend mutation hooks exist for all four client task status updates and properly invalidate query cache",
      "acceptanceCriteria": [
        "Backend exposes updateClientToDoStatus, updateClientTimelineStatus, updateClientFollowUpStatus, and updateClientDeadlineStatus (or equivalent) methods.",
        "Each method validates that the calling principal owns the task before allowing the update.",
        "Frontend mutation hooks exist for each of the four task-type status updates.",
        "Hooks invalidate the relevant query cache keys upon success so the UI reflects the new status."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useComplianceAdmin.ts",
          "operation": "modify",
          "description": "Verify that the four client-facing status update mutation hooks (useUpdateClientToDoStatus, useUpdateClientTimelineStatus, useUpdateClientFollowUpStatus, useUpdateClientDeadlineStatus) exist and are correctly configured. If any are missing from REQ-1 implementation, add them now. Each hook must call actor.updateClient[TaskType]Status(taskId, newStatus), handle errors, and invalidate the corresponding query keys: ['myToDos'], ['myTimelines'], ['myFollowUps'], ['myDeadlines']. The backend interface already exposes updateClientToDoStatus, updateClientTimelineStatus, updateClientFollowUpStatus, and updateClientDeadlineStatus methods that accept (taskId: bigint, newStatus: [Status]) and validate principal ownership."
        }
      ]
    }
  ]
}