{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Client Document Upload & Approval Login Details in Admin",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add document upload UI to Client Portal page for authenticated clients to upload their own documents",
      "acceptanceCriteria": [
        "An upload form or button is visible in the client portal documents tab for authenticated clients.",
        "The client can select a file and a document type before submitting.",
        "On successful upload, the new document appears in the documents list without a full page reload.",
        "Upload errors are displayed clearly to the client.",
        "The upload calls the existing uploadDocument mutation from useDocuments.ts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DocumentUploadForm.tsx",
          "operation": "create",
          "description": "Create a new DocumentUploadForm component that renders a form allowing clients to select a file, choose a document type (payrollReport, auditDoc, taxFiling), and submit via the uploadDocument mutation from useDocuments hook. Include file input, document type dropdown, submit button, loading state during upload, success message on completion, and error display on failure. Use ExternalBlob.fromBytes to convert the selected file and attach upload progress tracking via withUploadProgress. Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ClientPortalPage.tsx",
          "operation": "modify",
          "description": "Import and render the new DocumentUploadForm component within the Documents tab, positioned above the existing DocumentTable component. The upload form should be visible only to authenticated clients. After a successful upload, the documents list should refresh automatically via query invalidation."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display login details (principal ID and email) of approval requesters in Admin Dashboard Client Approval tab",
      "acceptanceCriteria": [
        "Each entry in the Client Approval tab shows the requester's principal ID.",
        "Each entry shows the requester's registered email address from their user profile.",
        "The existing approve/reject action controls remain functional.",
        "If the profile cannot be fetched, a fallback (e.g., 'Unknown') is displayed gracefully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useUserProfile.ts",
          "operation": "modify",
          "description": "Add a new React Query hook useGetUserProfile(principal: Principal) that calls actor.getUserProfile(principal) to fetch a specific user's profile by principal ID. Enable the query only when actor is available and principal is provided. Return the UserProfile or null if not found."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "In the Client Approval tab section, for each approval entry (UserApprovalInfo), use the new useGetUserProfile hook to fetch the profile for each requester's principal. Display the principal ID using principal.toString() and the email address from the fetched UserProfile. If the profile fetch fails or returns null, display 'Unknown' or 'No email' as a graceful fallback. Maintain the existing approve/reject button controls alongside the displayed login details."
        }
      ]
    }
  ]
}