{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin portal access for finproledge@gmail.com",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure finproledge@gmail.com is reliably granted admin access in AdminGuard, bypassing or correctly resolving the backend role check",
      "acceptanceCriteria": [
        "A user whose verified email is finproledge@gmail.com can navigate to the admin portal without being shown a 'not authorized' or login-prompt screen.",
        "AdminGuard correctly identifies finproledge@gmail.com as an admin during the email-verification fallback path.",
        "The admin portal tabs (service requests, documents, approvals, payments, deliverables, analytics) are all visible and functional for finproledge@gmail.com.",
        "No regression: users without admin privileges are still blocked by AdminGuard."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminGuard.tsx",
          "operation": "modify",
          "description": "Fix the email-based admin override logic to reliably grant access when the authenticated user's verified email is finproledge@gmail.com. Ensure the email verification fallback path correctly identifies this email as an admin. Add robust error handling and loading states to prevent premature redirects. Verify that the backend admin check (isCallerAdmin) and the email override work in harmony without race conditions."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Surface admin-only navigation links when authenticated user email is finproledge@gmail.com",
      "acceptanceCriteria": [
        "Admin navigation links are visible in the top nav bar when logged in as finproledge@gmail.com.",
        "Admin navigation links remain hidden for non-admin users."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Update the admin link visibility logic to include the email-based override (finproledge@gmail.com) in addition to the backend isCallerAdmin check. Ensure that when the user profile email matches finproledge@gmail.com, admin navigation items (Admin Dashboard, Compliance Admin) are displayed. Maintain consistency with the AdminGuard email verification pattern to prevent UI discrepancies."
        }
      ]
    }
  ]
}