{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix approvals data mapping, file corruption in upload workflow, and add Documents filter bar",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Audit and fix approvals data mapping to display all fields without truncation",
      "acceptanceCriteria": [
        "All approval records returned by the backend are rendered in the approvals list without truncation.",
        "Every field of each approval object (including nested objects such as client profile details, status, timestamps) is displayed in the UI.",
        "No approval entry or sub-field is silently omitted due to missing or incorrect data mapping.",
        "The approvals list re-fetches and stays in sync after any status update or mutation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useApprovals.ts",
          "operation": "modify",
          "description": "Audit the listApprovals query hook to ensure it exposes all fields returned by the backend. Verify the query invalidation logic triggers correctly after approval status mutations to keep the list in sync."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Audit the Approvals tab section to ensure all UserApprovalInfo fields (principal, status) are rendered. Add display of any additional detail fields if available. Remove any truncation, filtering, or pagination logic that silently hides approval records. Ensure the table or list component shows the complete approval dataset. After rendering changes, verify query invalidation ensures the UI updates when approval status changes."
        },
        {
          "path": "frontend/src/hooks/useUserProfile.ts",
          "operation": "modify",
          "description": "Ensure the useGetUserProfileByPrincipal hook (or equivalent profile lookup) is available and can be used to resolve principal IDs to user profiles (name, email, company) for display in the approvals list. This enables showing human-readable client details alongside each approval entry."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix file upload and download pipeline to prevent corruption and preserve original format",
      "acceptanceCriteria": [
        "A file uploaded by a client through the Deliverable or To-Do form is received by the admin with identical byte content to the original.",
        "The admin can open and read the downloaded file in its native application (e.g., PDF viewer, Word, Excel).",
        "MIME type metadata is preserved end-to-end so the browser/OS associates the file with the correct application.",
        "No Base64 double-encoding, truncation, or byte-level corruption occurs during upload or download."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ClientDeliverableForm.tsx",
          "operation": "modify",
          "description": "Audit the file upload logic to ensure the File object is read as an ArrayBuffer (not Base64 string) and converted to Uint8Array before calling ExternalBlob.fromBytes(). Verify the MIME type is correctly extracted from the File object and passed alongside the blob. Confirm no double-encoding or truncation occurs during the conversion. Verify the component's usage instructions for the blob-storage component before implementing."
        },
        {
          "path": "frontend/src/components/CreateToDoForm.tsx",
          "operation": "modify",
          "description": "Audit the file upload logic for to-do document attachments. Ensure the File is read as ArrayBuffer, converted to Uint8Array, and wrapped in ExternalBlob.fromBytes() without encoding corruption. Verify MIME type and file name are preserved. Confirm the ToDoDocument structure includes correct mimeType and fileName fields. Verify the component's usage instructions for the blob-storage component before implementing."
        },
        {
          "path": "frontend/src/components/ClientCreateToDoForm.tsx",
          "operation": "modify",
          "description": "Audit the client-side to-do creation form's file upload logic. Ensure ArrayBuffer conversion to Uint8Array and ExternalBlob.fromBytes() wrapping is correct, with MIME type and file name preserved in the ToDoDocument payload. Verify the component's usage instructions for the blob-storage component before implementing."
        },
        {
          "path": "frontend/src/components/DocumentTable.tsx",
          "operation": "modify",
          "description": "Audit the file download logic in the download button handler. Ensure ExternalBlob.getBytes() retrieves the original Uint8Array without corruption. Verify the Blob constructor receives the byte array and correct MIME type (from document.mimeType). Confirm the download URL is created correctly and triggers a browser download with the original file name. Test that the downloaded file opens in its native application. Verify the component's usage instructions for the blob-storage component before implementing."
        },
        {
          "path": "frontend/src/components/ComplianceAdminToDoList.tsx",
          "operation": "modify",
          "description": "Audit the to-do document download logic (if present). Ensure the download handler reconstructs the file from ExternalBlob.getBytes() using the correct MIME type from the ToDoDocument structure. Verify the file opens correctly after download. Verify the component's usage instructions for the blob-storage component before implementing."
        },
        {
          "path": "frontend/src/components/AdminClientDeliverableTable.tsx",
          "operation": "modify",
          "description": "Audit the deliverable file download logic to ensure correct byte reconstruction from ExternalBlob and MIME type preservation. Verify downloaded files are not corrupted. Verify the component's usage instructions for the blob-storage component before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add persistent filter bar to Documents view with type, date range, and name filters plus sort controls",
      "acceptanceCriteria": [
        "A filter bar is visible above the documents table in both the Admin Documents tab and the Client Portal Documents tab.",
        "Filtering by document type narrows the list to only matching entries.",
        "Filtering by upload date range shows only documents uploaded within the specified window.",
        "Free-text search on document name filters results in real time.",
        "Sort controls allow ascending/descending sort by date and alphabetical sort by name.",
        "Clearing all filters restores the full document list.",
        "Filter and sort state is applied client-side without requiring additional backend calls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DocumentTable.tsx",
          "operation": "modify",
          "description": "Add a persistent filter bar above the documents table with: a document type dropdown (multi-select or single select using DocumentType enum values), a date range picker (from/to date inputs), and a free-text search input for document name. Add sort controls (dropdown or toggle buttons) to sort by upload date (ascending/descending) or document name (A–Z / Z–A). Implement client-side filtering and sorting logic using the existing tableHelpers utilities or custom logic. Apply filters reactively as values change. Provide a clear-all-filters button to reset state. Ensure the filter bar is responsive and matches the existing design system."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Ensure the Admin Documents tab renders the updated DocumentTable component with the new filter bar. Verify the filter bar is visible and functional in the admin context. No additional wiring is needed if DocumentTable is already used in this tab."
        },
        {
          "path": "frontend/src/pages/ClientPortalPage.tsx",
          "operation": "modify",
          "description": "Ensure the Client Portal Documents tab renders the updated DocumentTable component with the new filter bar. Verify the filter bar is visible and functional in the client context. No additional wiring is needed if DocumentTable is already used in this tab."
        },
        {
          "path": "frontend/src/utils/tableHelpers.ts",
          "operation": "modify",
          "description": "If needed, extend the existing sorting and filtering utilities to support date-range filtering and multi-criteria filtering (type + date + name). Ensure the utilities handle nanosecond timestamps correctly for date comparisons. Provide helper functions that can be reused in DocumentTable."
        }
      ]
    }
  ]
}