{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Project with approvals list, deliverables/to-dos upload workflow, and documents view with filtering capabilities.",
  "architectural_notes": [],
  "known_issues": [
    "Approvals list is truncated or missing detail fields; data sync issues with nested client approval objects",
    "File corruption in Deliverables/To-Dos upload workflow - files unreadable upon admin receipt"
  ],
  "isFixRequest": true,
  "existing_features": [],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix approvals list truncation - audit data mapping to ensure all client approval objects and nested details are rendered in UI",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Fix file corruption in Deliverables/To-Dos upload workflow - files become unreadable/corrupted when admin receives them",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add filter bar in Documents view to sort/query documents by specific attributes",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Audit the approvals data mapping in the frontend: inspect all fields returned by the backend `listApprovals` (or equivalent) query and ensure every field on each approval object — including nested detail fields such as client profile info, status, timestamps, and any sub-objects — is correctly destructured and rendered in the approvals tab of the Admin Dashboard. Remove any truncation logic that silently hides records or fields. Ensure the UI displays a complete, untruncated list of all approval entries with all their detail fields visible.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Fix the file upload pipeline for Deliverables and To-Dos so that files attached by the client arrive at the admin side in their original, readable format. Audit the `ExternalBlob` conversion in `ClientDeliverableForm.tsx`, `CreateToDoForm.tsx`, and `ClientCreateToDoForm.tsx`: verify that the file is read as an `ArrayBuffer` or `Uint8Array` and stored as the correct Blob type without encoding corruption. On the admin download side, audit the reconstruction logic in `DocumentTable.tsx`, `ComplianceAdminToDoList.tsx`, and any download utility so that the original MIME type and byte sequence are preserved. Ensure the downloaded file opens correctly in its original application.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Add a persistent filter bar at the top of the Documents view (in `DocumentTable.tsx` and the Documents tab of the Admin Dashboard and Client Portal). The filter bar must allow querying/filtering by: document type (e.g., dropdown or multi-select of available types), upload date range (from/to date pickers), and document name (free-text search). Additionally provide a sort control to sort the document list by upload date (ascending/descending) or document name (A–Z / Z–A). Filters should apply reactively as values change without requiring a separate submit action.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "FinProLedge",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}